{
"abs":[
      {
         "Exercise":"ab roller",
         "Descriptions":"Hold the Ab Roller wheel on the floor with both hands as you kneel and have your back straight. Push the Ab Roller forward while your core stretches as you get lower. After a pause, roll the wheel back towards you as you end up in the starting position.",
         "Secondary":"Forearms", "link":"https://www.youtube.com/embed/A3uK5TPzHq8"
      },
      {
         "Exercise":"air bike",
         "Descriptions":"Lie down on your back with your knees up and lower legs parallel to the floor. Follow a bicycle motion by bringing your left knee towards your body and kick your right knee out, and then alternate the legs. When you bring your knee towards your body, lift up your shoulder so your elbow makes contact with the knee and your abs contract.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/GbArfJRN2wY"
      },
      {
         "Exercise":"barbell ab rollout",
         "Descriptions":"Kneel on the floor as you hold a barbell with small 5-10lb weights on. Roll the barbell forward while your core stretches as you get lower. After holding that position, roll the barbell towards you as you end up in the starting position.",
         "Secondary":"Forearms", "link":"https://www.youtube.com/embed/O-d6HC9gLcw"
      },
      {
         "Exercise":"barbell side bend",
         "Descriptions":"Stand up straight with a barbell resting on the back of your shoulders and feet shoulder width apart. Bend your waist to the right/left and hold. Move your torso upwards again to the starting position while you alternate the directions.",
         "Secondary":"Forearms",
        "link":"https://www.youtube.com/embed/F_9UT6oVRo4"
      },
      {
         "Exercise":"bent press",
         "Descriptions":"Take a kettlebell and bend your arm so the weight touches your shoulder. Simultaneously bend your waist to the left/right while your other arm touches your foot. Outstretch your arms to bring the weight up to the air and then rotate your body back up.",
         "Secondary":"Forearms",
          "link":"https://www.youtube.com/embed/Syp93HH3xow"
      },
      {
         "Exercise":"bottoms up",
         "Descriptions":"Lie down on your back with your legs straight and arms to the side. Move your knees toward your chest using your hip flexors. After that raise your legs to the air so they are perpendicular to the ground and then rotate your glutes even more so your legs and lower back don’t touch the ground.",
         "Secondary":"Forearms",
          "link":"https://www.youtube.com/embed/hTeMXA_1l5I"
      },
      {
         "Exercise":"butt-ups",
         "Descriptions":"Start off in a pushup position, back straight but resting on your forearms instead of your hands. Move your back so it is arched slightly, raise your glutes and squeeze your abs. After holding the bridge position, slowly lower your back to the starting pushup position.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/4adi13LakZ0"
      },
      {
         "Exercise":"cable crunch",
         "Descriptions":"Kneel on your knees in front of a cable machine with the rope attachment in your hands. Bring your head down so your body is curled and hold the rope beside your head. Move your waist up so your back is straight instead of curled and have your lower body stationary. Go back down to the curled starting position.",
         "Secondary":"Forearms",
         "link":" https://www.youtube.com/embed/vsAPBAg0fb0"
      },
      {
         "Exercise":"cable judo flip",
         "Descriptions":"Using a cable machine with the rope attachment, stand up straight and face away from it and pull the rope from the lowest position to the top of your shoulder. Bend your waist downwards like you’re judo flipping someone from your shoulder. After that repeat the movement in the other direction.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/dfB2MPXzjYc"
      },
      {
         "Exercise":"cable russian twists",
         "Descriptions":"Using a standard handle on the cable machine, lie down on an exercise ball and grab the handle with both hands above your chest. Rotate your arms and hips left/right, hold your torso in that position and then return back to the starting position.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/yckjJqPMyaY"
      },
      {
         "Exercise":"cocoons",
         "Descriptions":"Lie down on your back with your legs extended and arms stretched above your head. Tuck your knees towards your chest and grab your legs with your arms as you curl your spine above the floor. Unravel your body back to the starting position.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/C6T8ozMcRQc"
      },
      {
         "Exercise":"crunch - hands overhead",
         "Descriptions":"Lie down on your back with arms outstretched above your head, and legs bent in a 60-degree angle on the ground. Curl your upper body forward and have your shoulders rise above the floor with your arms still above your head. After holding the crunch, move your body back down to the floor.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/XbrA2n8aEHE"
      },
      {
         "Exercise":"crunches",
         "Descriptions":"Lie down on your back with arms touching the back of your head, and legs bent in a 90-degree angle on the ground. Move your shoulders off the floor, using your lower back to push your body upwards. As your abs contract, hold the position and then go back down.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/Xyd_fa5zoEU"
      },
      {
         "Exercise":"decline oblique crunch",
         "Descriptions":"Lie down on a decline bench with one arm touching the back of your head and the other arm touching your thigh. Lift your shoulders up from the bench while contracting your abs in a diagonal direction until your elbow touches your other knee. Go back down and after you finish reps on one side, alternate to the other side.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/QM9iwYWUouo"
      },
      {
         "Exercise":"decline reverse crunch",
         "Descriptions":"Lie down in the reverse direction of a decline bench(legs on the floor and arms holding the top). Pull your legs and glutes up to the sky and hold this contraction in your abs and then move your legs back down to the floor.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/YcMj0EEadQo"
      },
      {
         "Exercise":"double kettlebell windmill",
         "Descriptions":"Place a kettlebell in front of your front foot and clean and press a kettlebell overhead with your opposite arm. Clean the kettlebell to your shoulder by extending through the legs and hips as you pull the kettlebell towards your shoulders. Bending at the hip to one side, sticking your butt out, slowly lean until you can retrieve the kettlebell from the floor. Keep your eyes on the kettlebell that you hold over your head at all times.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/E6ftrsUsZFc"
      },
      {
         "Exercise":"dumbbell side bend",
         "Descriptions":"Hold a dumbbell in one of your hands while standing up straight and your other hand holding your waist. Bend at the waist to the side as far as you can go while keeping your back straight. Now bend your waist at the opposite direction and then come back to the starting position.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/_bVcLMlYZM8"
      },
      {
         "Exercise":"elbow to knee",
         "Descriptions":"Lie down on the floor with one leg extended and the other leg bent up at the knee. Start the movement by bringing your opposite elbow to the bent knee by rotating your torso so your abs get flexed. Now switch to the opposite arm and leg to stretch the other side of the abs.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/orvO32fHb1A"
      },
      {
         "Exercise":"exercise ball pull-in",
         "Descriptions":"Rest your legs on an exercise ball while you support your upper body with your arms in a pushup position. Pull your knees towards your chest while rolling the ball forward and hold the position. Straighten your legs and return to the starting position.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/3R81zuUD_L0"
      },
      {
         "Exercise":"flat bench leg pull-in",
         "Descriptions":"Lie down with your back on a flat bench, legs extended straight, and hands under your glutes. Bend your knees into your midsection and breathe out and hold this position. Bring your legs back out as you return to the starting position.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/GPBVNHl5cS8"
      },
      {
         "Exercise":"frog sit-ups",
         "Descriptions":"Lie down with your back on the floor and legs bend at the knees and the soles of your feet touching each other. Cross your arms by holding the opposite shoulder and curl your torso upwards in this position. You only need to go up ¼ the length of a normal sit-up to feel the contraction in your abs, then go back down.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/jZJZxt8WyQI"
      },
      {
         "Exercise":"hanging pike",
         "Descriptions":"Grab on a pull up bar and hang there with your body straight. Flex the hips and bring your legs straight up and try to touch the bar with the bottom of your feet. Swing your legs back down as you return to the starting position.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/wVRlRmGsZ2w"
      },
      {
         "Exercise":"jackknife sit-up",
         "Descriptions":"Lie down on the floor with your legs extended and arms extended behind your head. Bend at the waist and raise your arms and legs to meet in the middle of this contraction at a 35-45 degree angle off the floor. Lower your arms and legs back down to the starting position.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/-4wSVuGTcKU"
      },
      {
         "Exercise":"kettlebell figure 8",
         "Descriptions":"Place one kettlebell between your legs and take a wider than shoulder width stance. Bend over by pushing your butt out and keeping your back flat. Pick up a kettlebell and pass it to your other hand between your legs. The receiving hand should reach from behind the legs. Go back and forth for several repetitions.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/xpHWMC2_e3c"
      },
      {
         "Exercise":"kettlebell windmill",
         "Descriptions":"Place a kettlebell in front of your lead foot and clean and press it overhead with your opposite arm. Clean the kettlebell to your shoulder by extending through the legs and hips as you pull the kettlebell towards your shoulders. Rotate your wrist as you do so, so that the palm faces forward. Press it overhead by extending the elbow.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/ITSmgn_BQgY"
      },
      {
         "Exercise":"medicine ball full twist",
         "Descriptions":"Stand back to back with a partner as you hold a medicine ball in front of you. Rotate your rips and shoulders and pass the ball midway when you meet your partner and then repeat the spinning until tired.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/U9kXhepzzWA"
      },
      {
         "Exercise":"oblique crunches",
         "Descriptions":"Lie down with your back on the floor and knees elevated, put one hand in the back of your head and the other on the floor. Lift your shoulder and body sideways until you contact your knee. Now lower your body back to the starting position.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/QxaKQG-gmPY"
      },
      {
         "Exercise":"one-arm medicine ball slam",
         "Descriptions":"Stand up holding a medicine ball with one hand. Wind up your arm as you raise the ball above your head, using your lower body to extend to prepare for a downward motion. Slam the ball down in front of you, flexing the shoulders, hips, and spine.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/XKFyHOp1d0k"
      },
      {
         "Exercise":"overhead stretch",
         "Descriptions":"Stand up straight and have your arms in the air, having both hands grab each other with palms in the air. Pull your body by stretching your torso, pulling on both your front and back muscles.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/QYezrlpg3L8"
      },
      {
         "Exercise":"pallof press with rotation",
         "Descriptions":"Grab a handle on a middle height cable machine with both arms outstretched in front of you. Pull the cable towards your chest and then towards your side and then back in front of you. Repeat the movement for the opposite side of your body to engage the abs fully.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/zoYwuVw3kkQ"
      },
      {
         "Exercise":"plank",
         "Descriptions":"Get down on the floor in a pushup position, with your forearms supporting your body. Keep your back straight in this position and support your body as long as possible.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/pSHjTRCQxIw"
      },
      {
         "Exercise":"press sit-up",
         "Descriptions":"Lie down on a decline bench holding a barbell on your chest. Lift your shoulders and back up from the bench and bring the barbell up over your head. Lower your body down on the bench and then repeat the movement.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/fiCNUs8TVxw"
      },
      {
         "Exercise":"reverse crunch",
         "Descriptions":"Lie down on the floor with your legs bent, perpendicular to the floor. Move your legs towards your upper body and then bring the pelvis and lower back up off the floor until your knees touch your chest. Lower your legs back to the starting position.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/hyv14e2QDq0"
      },
      {
         "Exercise":"russian twist",
         "Descriptions":"Lie down on the floor with support holding your feet in place. Keep your upper body off the floor so it created a V-shape with your thighs. Also hold a weight in your arms outstretched in front of you. Twist your torso left and right, holding each contraction for a second while you repeat the movement.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/wkD8rjkodUI"
      },
      {
         "Exercise":"seated flat bench leg pull-in",
         "Descriptions":"Sit on the end of a flat bench with your legs stretched out in front of you. Lean your torso backwards so you are close to touching the bench. Bring your knees in towards your body and bring your torso closer inwards as well. After a pause bring your legs out again.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/Jb8L3ARFYWk"
      },
      {
         "Exercise":"sit-up",
         "Descriptions":"Lie down on the floor with a support holding your feet and your legs bent at the knees. Place your hands behind your head. Now elevate your shoulders and upper body until you fully contract your abs. Now go back down and repeat the movement.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/1fbU_MkV7NE"
      },
      {
         "Exercise":"sledgehammer swings",
         "Descriptions":"With a tire laying on the floor and a sledgehammer held in your hands, stand up with your legs slightly bent. Bring the sledgehammer up with your arms and shoulders and then slam it down hard on the tire. Control the bounce as you repeat the motion on the other side of the tire.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/aFCxAF96Sjw"
      },
      {
         "Exercise":"spider crawl",
         "Descriptions":"Start off with your hands and toes supporting your body on the floor. Raise one foot off the ground and rotate the leg to bring your knee towards your elbow. Return your leg back to the starting position and repeat the movement with your opposite leg.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/_K7rv_vFOWM"
      },
      {
         "Exercise":"standing cable lift",
         "Descriptions":"With both hands, grab a cable pulley handle set to the lowest position. Face sideways to the cable machine and positioned an arm’s length away. In one motion bring the cable up across your body until fully extended above your head. Bring your arms back down to the starting position. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/VtLAtFkZWQE"
      },
      {
         "Exercise":"standing rope crunch",
         "Descriptions":"Stand up with your back turned from a cable machine with the rope attachment. Put the rope between your shoulders and hold it towards your upper chest. Now move your torso downwards as your flex your spine and do a crunch motion as far back down as you can go. Hold the position as you return back up when you’re done.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/vsAPBAg0fb0"
      },
      {
         "Exercise":"supine one-arm overhead throw",
         "Descriptions":"Lay on the ground on your back with your knees bent. Hold a ball with one hand, extending the arm fully behind your head. Throw the ball in front of you as far as you can as you sit up. You can bounce the ball at a wall or with a partner.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/uPqAd82GUfY"
      },
      {
         "Exercise":"toe touchers",
         "Descriptions":"Lie down on the floor with your legs elevated in the air until they are perpendicular to the floor with a slight knee bend. Move your arms up so you can try to reach for your toes. You can lower your torso and arms back down once finished contracting the abs.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/y6Bv_0Shhc8"
      },
      {
         "Exercise":"wind sprints",
         "Descriptions":"Hang from a pullup bar with your arms and legs extended. Raise one knee as high as you can and reverse the motion with your other knee. Alternate this movement and try not to swing your body as you perform the sprint.",
         "Secondary":"Forearms",
         "link":"https://www.bodybuilding.com/exercises/wind-sprints"
      },
      {
         "Exercise":"hip circles (prone)",
         "Descriptions":"Place your hands and knees on the ground and with your back straight, raise one bent knee off the ground. Rotate your femur in an arc and make a big circle movement with your knee. Repeat the movement with your other leg.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/hIrD_K5xVLI"
      },
      {
         "Exercise":"iliotibial tract-smr",
         "Descriptions":"Lay on your side, with the bottom leg placed onto a foam roller between the hip and the knee. The other leg can be crossed in front of you. Place as much of your weight as is tolerable onto your bottom leg; there is no need to keep your bottom leg in contact with the ground. Be sure to relax the muscles of the leg you are stretching. Roll your leg over the foam from you hip to your knee, pausing for 10-30 seconds at points of tension. Repeat with the opposite leg.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/u0mbQIelczA"
      },
      {
         "Exercise":"standing hip circles",
         "Descriptions":"Stand up on one leg and hold onto a vertical support. Raise your other knee 90 degrees and open up your hip as your make a circular motion with your knee. Repeat this reputation and switch legs when done.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/qRhEnPig55k"
      },
      {
         "Exercise":"adductor/groin",
         "Descriptions":"Lie on your back with your legs raised to the ceiling and have a partner hold your feet and ankles. Squeeze your legs together for 10+ seconds while your partner tries to pull your legs back the other direction. Relax your muscles as your partner brings your feet back apart.",
         "Secondary":"Forearms",
         "link":"https://www.bodybuilding.com/exercises/adductorgroin-"
      },
      {
         "Exercise":"groin and back stretch",
         "Descriptions":"Sit up on the floor with your knees bent and feet together. Place your hands behind your head and then curl your body downwards as you bring your elbows towards your inner thighs. After a pause, return to the starting position with your head up and back straight.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/ZADA5EzIj_k"
      },
      {
         "Exercise":"lateral box jump",
         "Descriptions":"Stand up straight with a short box positioned next to you. Go down slightly in a quarter squat and then jump up to the side over the box, land on the venter of the box and then jump to the other side. Continue going back and forth for several repetitions.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/JSZusYoQ3RA"
      },
      {
         "Exercise":"side leg raises",
         "Descriptions":"Stand up on one leg while holding onto a support. Raise your leg to the side as far out as possible and keep it straight. Swing it back down and repeat the motion until you fully feel the stretch.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/H8RrfDOLiZU"
      },
      {
         "Exercise":"thigh adductor",
         "Descriptions":"Sit down on an adductor machine with legs positioned onto the leg pads and grip each handle with your hands. Press the machine by bringing your legs close to each other, hold this position, and then return to the starting position.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/GmRSV_n2E_0"
      }
   ]
    
}