{
"Arms": [

{
         "Exercise":"alternate hammer curl",
         "Descriptions":"Stand upright with dumbbell in each hand with the palms of your hand facing your thighs. While keeping the upper limb stationary, curl the dumbbell until forearm touches your biceps. Return to starting position and repeat with the other arm.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/NEoIeunvMKA"
      },
      {
         "Exercise":"alternate incline dumbbell curl",
         "Descriptions":"Sit down on an incline bench with a dumbbell in each hand being held at arms length. Tip: Keep the elbows close to the torso.This will be your starting position. While holding the upper arm stationary, curl the right weight forward while contracting the biceps as you breathe out. As you do so, rotate the hand so that the palm is facing up. Continue the movement until your biceps is fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a second as you squeeze the biceps. Tip: Only the forearms should move. Slowly begin to bring the dumbbell back to starting position as your breathe in. Repeat the movement with the left hand. This equals one repetition. Continue alternating in this manner for the recommended amount of repetitions.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/cv94zLJo2Mk"
      },
      {
         "Exercise":"barbell curls lying against an incline",
         "Descriptions":"Lie against an incline bench, with your arms holding a barbell and hanging down in a horizontal line. This will be your starting position.While keeping the upper arms stationary, curl the weight up as high as you can while squeezing the biceps. Breathe out as you perform this portion of the movement. Tip: Only the forearms should move. Do not swing the arms. After a second contraction, slowly go back to the starting position as you inhale. Tip: Make sure that you go all of the way down. Repeat for the recommended amount of repetitions.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/oy3_Sfm3SFY"
      },
      {
         "Exercise":"cable hammer curls - rope attachment",
         "Descriptions":"Attach a rope attachment to a low pulley and stand facing the machine about 12 inches away from it.Grasp the rope with a neutral (palms-in) grip and stand straight up keeping the natural arch of the back and your torso stationary.Put your elbows in by your side and keep them there stationary during the entire movement. Tip: Only the forearms should move; not your upper arms. This will be your starting position.Using your biceps, pull your arms up as you exhale until your biceps touch your forearms. Tip: Remember to keep the elbows in and your upper arms stationary.After a 1 second contraction where you squeeze your biceps, slowly start to bring the weight back to the original position.Repeat for the recommended amount of repetitions.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/PslvRTdHJHY"
      },
      {
         "Exercise":"close-grip ez bar curl",
         "Descriptions":"Stand up with your torso upright while holding an E-Z Curl Bar at the closer inner handle. The palm of your hands should be facing forward and they should be slightly tilted inwards due to the shape of the bar. The elbows should be close to the torso. This will be your starting position.While holding the upper arms stationary, curl the weights forward while contracting the biceps as you breathe ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/o74HeVd6BIw"
      },
      {
         "Exercise":"concentration curls",
         "Descriptions":"Sit down on a flat bench with one dumbbell in front of you between your legs. Your legs should be spread with your knees bent and feet on the floor.Use your right arm to pick the dumbbell up. Place the back of your right upper arm on the top of your inner right thigh. Rotate the palm of your hand until it is facing forward away from your thigh. Tip: Your arm should be extended and the dumbbell should be above the floor. This will be your starting position.While holding the upper arm stationary, curl the weights forward while contracting the biceps as you breathe out. Only the forearms should move. Continue the movement until your biceps are fully contracted and the dumbbells are at shoulder level. Tip: At the top of the movement make sure that the little finger of your arm is higher than your thumb. This guarantees a good contraction. Hold the contracted position for a second as you squeeze the biceps.Slowly begin to bring the dumbbells back to starting position as your breathe in. Caution: Avoid swinging motions at any time.Repeat for the recommended amount of repetitions. Then repeat the movement with the left arm.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/Jvj2wV0vOYU"
      },
      {
         "Exercise":"dumbbell bicep curl",
         "Descriptions":"Stand up straight with a dumbbell in each hand at arm's length. Keep your elbows close to your torso and rotate the palms of your hands until they are facing forward. This will be your starting position.Now, keeping the upper arms stationary, exhale and curl the weights while contracting your biceps. Continue to raise the weights until your biceps are fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a brief pause as you squeeze your biceps.Then, inhale and slowly begin to lower the dumbbells back to the starting position.Repeat for the recommended amount of repetitions.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/ykJmrZ5v0Oo"
      },
      {
         "Exercise":"dumbbell prone incline curl",
         "Descriptions":"Grab a dumbbell on each hand and lie face down on an incline bench with your shoulders near top of the incline. Your knees can rest on the seat or your legs can be straddled to the sides (my preferred way).Let your arms extend and hang naturally in front of you so that they are perpendicular to the floor.Now keep your elbows in by your side and face the palms forward. This will be your starting position.Raise the dumbbells by contracting the biceps until your arms are fully flexed. Exhale as you perform this portion of the movement and ensure that only the forearms move. The upper arms should remain stationary at all times.Lower the dumbbells until your arms are fully extended.Repeat for the recommended amount of times.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/OK6vpxXZ2pk"
      },
      {
         "Exercise":"flexor incline dumbbell curls",
         "Descriptions":"Hold the dumbbell towards the side farther from you so that you have more weight on the side closest to you. (This can be done for a good effect on all bicep dumbbell exercises). Now do a normal incline dumbbell curl, but keep your wrists as far back as possible so as to neutralize any stress that is placed on them.Sit on an incline bench that is angled at 45-degrees while holding a dumbbell on each hand.Let your arms hang down on your sides, with the elbows in, and turn the palms of your hands forward with the thumbs pointing away from the body. Tip: You will keep this hand position throughout the movement as there should not be any twisting of the hands as they come up. This will be your starting position.Curl up the two dumbbells at the same time until your biceps are fully contracted and exhale. Tip: Do not swing the arms or use momentum. Keep a controlled motion at all times. Hold the contracted position for a second at the top.As you inhale, slowly go back to the starting position.Repeat for the recommended amount of repetitions.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/xa1gqPP886Q"
      },
      {
         "Exercise":"incline dumbbell curl",
         "Descriptions":"Sit back on an incline bench with a dumbbell in each hand held at arms length. Keep your elbows close to your torso and rotate the palms of your hands until they are facing forward. This will be your starting position.While holding the upper arm stationary, curl the weights forward while contracting the biceps as you breathe out. Only the forearms should move. Continue the movement until your biceps are fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a second.Slowly begin to bring the dumbbells back to starting position as your breathe in.Repeat for the recommended amount of repetitions.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/2Kl0aUo-e4A"
      },
      {
         "Exercise":"incline hammer curls",
         "Descriptions":"Seat yourself on an incline bench with a dumbbell in each hand. You should pressed firmly against he back with your feet together. Allow the dumbbells to hang straight down at your side, holding them with a neutral grip. This will be your starting position.Initiate the movement by flexing at the elbow, attempting to keep the upper arm stationary.Continue to the top of the movement and pause, then slowly return to the start position.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/qpVDPGBij2A"
      },
      {
         "Exercise":"lying cable curl",
         "Descriptions":"Grab a straight bar or E-Z bar attachment that is attached to the low pulley with both hands, using an underhand (palms facing up) shoulder-width grip.Lie flat on your back on top of an exercise mat in front of the weight stack with your feet flat against the frame of the pulley machine and your legs straight.With your arms extended and your elbows close to your body slightly bend your arms. This will be your starting position.While keeping your upper arms stationary and the elbows close to your body, curl the bar up slowly toward your chest as you breathe out and you squeeze the biceps.After a second squeeze at the top of the movement, slowly return to the starting position.Repeat for the recommended amount of repetitions.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/khyjpRPUEB0"
      },
      {
         "Exercise":"lying close-grip bar curl on high pulley",
         "Descriptions":"Place a flat bench in front of a high pulley or lat pulldown machine. Hold the straight bar attachment using an underhand grip (palms up) that is about shoulder width. Lie on your back with your head over the end of the bench. Now extend your arms straight above your shoulders. Your torso and your arms should make a 90-degree angle and the elbows should be in. This will be your starting position. As you breathe out, curl the bar down in a semicircular motion until it touches your chin. Squeeze the biceps for a second at the top contracted position. Tip: As you execute this motion only the forearms should move. At no time should the upper arms be moving at all. They are to remain perpendicular throughout the movement. Return to starting position slowly. Repeat for the recommended amount of repetitions.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/11--Q3_DwLU"
      },
      {
         "Exercise":"machine preacher curls",
         "Descriptions":"Sit down on the Preacher Curl Machine and select the weight. Place the back of your upper arms (your triceps) on the preacher pad provided and grab the handles using an underhand grip (palms facing up). Tip: Make sure that when you place the arms on the pad you keep the elbows in. This will be your starting position. Now lift the handles as you exhale and you contract the biceps. At the top of the position make sure that you hold the contraction for a second. Tip: Only the forearms should move. The upper arms should remain stationary and on the pad at all times. Lower the handles slowly back to the starting position as you inhale. Repeat for the recommended amount of repetitions.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/OJlTCY9GVVk"
      },
      {
         "Exercise":"one arm dumbbell preacher curl",
         "Descriptions":"Grab a dumbbell with the right arm and place the upper arm on top of the preacher bench or the incline bench. The dumbbell should be held at shoulder length. This will be your starting position. As you breathe in, slowly lower the dumbbell until your upper arm is extended and the biceps is fully stretched. As you exhale, use the biceps to curl the weight up until your biceps is fully contracted and the dumbbell is at shoulder height. Again, remember that to ensure full contraction you need to bring that small finger higher than the thumb. Squeeze the biceps hard for a second at the contracted position and repeat for the recommended amount of repetitions. Switch arms and repeat the movement.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/WK5yZMlgMb4"
      },
      {
         "Exercise":"overhead cable curl",
         "Descriptions":"To begin, set a weight that is comfortable on each side of the pulley machine. Note: Make sure that the amount of weight selected is the same on each side. Now adjust the height of the pulleys on each side and make sure that they are positioned at a height higher than that of your shoulders. Stand in the middle of both sides and use an underhand grip (palms facing towards the ceiling) to grab each handle. Your arms should be fully extended and parallel to the floor with your feet positioned shoulder width apart from each other. Your body should be evenly aligned the handles. This is the starting position. While exhaling, slowly squeeze the biceps on each side until your forearms and biceps touch. While inhaling, move your forearms back to the starting position. Note: Your entire body is stationary during this exercise except for the forearms. Repeat for the recommended amount of repetitions prescribed in your program.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/5_n3gVeGEqc"
      },
      {
         "Exercise":"preacher curl",
         "Descriptions":"To perform this movement you will need a preacher bench and an E-Z bar. Grab the E-Z curl bar at the close inner handle (either have someone hand you the bar which is preferable or grab the bar from the front bar rest provided by most preacher benches). The palm of your hands should be facing forward and they should be slightly tilted inwards due to the shape of the bar. With the upper arms positioned against the preacher bench pad and the chest against it, hold the E-Z Curl Bar at shoulder length. This will be your starting position. As you breathe in, slowly lower the bar until your upper arm is extended and the biceps is fully stretched. As you exhale, use the biceps to curl the weight up until your biceps is fully contracted and the bar is at shoulder height. Squeeze the biceps hard and hold this position for a second. Repeat for the recommended amount of repetitions.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/vngli9UR6Hw"
      },
      {
         "Exercise":"reverse barbell preacher curls",
         "Descriptions":"Grab an EZ-bar using a shoulder width and palms down (pronated) grip. Now place the upper part of both arms on top of the preacher bench and have your arms extended. This will be your starting position. As you exhale, use the biceps to curl the weight up until your biceps are fully contracted and the barbell is at shoulder height. Squeeze the biceps hard for a second at the contracted position. As you breathe in, slowly lower the barbell until your upper arms are extended and the biceps is fully stretched. Repeat for the recommended amount of repetitions.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/30fM44Y2Htg"
      },
      {
         "Exercise":"seated close-grip concentration barbell curl",
         "Descriptions":"Sit down on a flat bench with a barbell or E-Z Bar in front of you in between your legs. Your legs should be spread with the knees bent and the feet on the floor. Use your arms to pick the barbell up and place the back of your upper arms on top of your inner thighs (around three and a half inches away from the front of the knee). A supinated grip closer than shoulder width is needed to perform this exercise. Tip: Your arm should be extended at arms length and the barbell should be above the floor. This will be your starting position. While holding the upper arms stationary, curl the weights forward while contracting the biceps as you breathe out. Only the forearms should move. Continue the movement until your biceps are fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a second as you squeeze the biceps. Slowly begin to bring the barbell back to starting position as your breathe in. Tip: Avoid swinging motions at any time. Repeat for the recommended amount of repetitions.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/Jqb9sLZoONs"
      },
      {
         "Exercise":"seated dumbbell inner biceps curl",
         "Descriptions":"Sit on the end of a flat bench with a dumbbell in each hand being held at arms length. The elbows should be close to the torso. Rotate the palms of the hands so that they are facing inward in a neutral position. This will be your starting position. While holding the upper arms stationary, curl the dumbbells out and up, turning the palms out as you lift and keeping your forearms in line with your outer deltoids. Tips: Only the forearms should move. Continue the movement until your biceps are fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a second as you squeeze the biceps. Slowly begin to bring the dumbbells back to the starting position as your breathe in. Remember to rotate your arms as you lower the dumbbells so that you can switch back to a neutral grip. Repeat for the recommended amount of repetitions.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/-4ksk48RSTk"
      },
      {
         "Exercise":"standing biceps cable curl",
         "Descriptions":"Stand up with your torso upright while holding a cable curl bar that is attached to a low pulley. Grab the cable bar at shoulder width and keep the elbows close to the torso. The palm of your hands should be facing up (supinated grip). This will be your starting position. While holding the upper arms stationary, curl the weights while contracting the biceps as you breathe out. Only the forearms should move. Continue the movement until your biceps are fully contracted and the bar is at shoulder level. Hold the contracted position for a second as you squeeze the muscle. Slowly begin to bring the curl bar back to starting position as your breathe in. Repeat for the recommended amount of repetitions.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/L9GwtjwAM8Y"
      },
      {
         "Exercise":"standing dumbbell reverse curl",
         "Descriptions":"To begin, stand straight with a dumbbell in each hand using a pronated grip (palms facing down). Your arms should be fully extended while your feet are shoulder width apart from each other. This is the starting position. While holding the upper arms stationary, curl the weights while contracting the biceps as you breathe out. Only the forearms should move. Continue the movement until your biceps are fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a second as you squeeze the muscle. Slowly begin to bring the dumbbells back to starting position as your breathe in. Repeat for the recommended amount of repetitions.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/GZaspj6Npp8"
      },
      {
         "Exercise":"standing inner-biceps curl",
         "Descriptions":"Stand up with a dumbbell in each hand being held at arms length. The elbows should be close to the torso. Your legs should be at about shoulder's width apart from each other. Rotate the palms of the hands so that they are facing inward in a neutral position. This will be your starting position. While holding the upper arms stationary, curl the weights out while contracting the biceps as you breathe out. Your wrist should turn so that when the weights are fully elevated you have supinated grip (palms facing up). Only the forearms should move. Continue the movement until your biceps are fully contracted and the dumbbells are at shoulder level. Tip: Keep the forearms aligned with your outer deltoids. Hold the contracted position for a second as you squeeze the biceps. Slowly begin to bring the dumbbells back to the starting position as your breathe in. Remember to rotate the wrists as you lower the weight in order to switch back to a neutral grip. Repeat for the recommended amount of repetitions.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/F95ps05kwWk"
      },
      {
         "Exercise":"standing one-arm cable curl",
         "Descriptions":"Start out by grabbing single handle next to the low pulley machine. Make sure you are far enough from the machine so that your arm is supporting the weight. Make sure that your upper arm is stationary, perpendicular to the floor with elbows in and palms facing forward. Your non lifting arm should be grabbing your waist. This will allow you to keep your balance. Slowly begin to curl the single handle upwards while keeping the upper arm stationary until your forearm touches your bicep while exhaling. Tip: Only the forearm should move. Hold the contraction position as you squeeze the bicep and then lower the single handle back down to the starting position as you inhale. Repeat for the recommended amount of repetitions. Switch arms while performing this exercise.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/eB2ZkrvNzKE"
      },
      {
         "Exercise":"two-arm dumbbell preacher curl",
         "Descriptions":"Grab a dumbbell with each arm and place the upper arms on top of the preacher bench or the incline bench. The dumbbell should be held at shoulder length. This will be your starting position. As you breathe in, slowly lower the dumbbells until your upper arm is extended and the biceps is fully stretched. As you exhale, use the biceps to curl the weights up until your biceps is fully contracted and the dumbbells are at shoulder height. Squeeze the biceps hard for a second at the contracted position and repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/m9pNFgTRnAM"
      },
      {
         "Exercise":"zottman curl",
         "Descriptions":"Stand up with your torso upright and a dumbbell in each hand being held at arms length. The elbows should be close to the torso. Make sure the palms of the hands are facing each other. This will be your starting position. While holding the upper arm stationary, curl the weights while contracting the biceps as you breathe out. Only the forearms should move. Your wrist should rotate so that you have a supinated (palms up) grip. Continue the movement until your biceps are fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a second as you squeeze the biceps. Now during the contracted position, rotate your wrist until you now have a pronated (palms facing down) grip with the thumb at a higher position than the pinky. Slowly begin to bring the dumbbells back down using the pronated grip. As the dumbbells close your thighs, start rotating the wrist so that you go back to a neutral (palms facing your body) grip. Repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/ZrpRBgswtHs"
      },
      {
         "Exercise":"zottman preacher curl",
         "Descriptions":"Grab a dumbbell in each hand and place your upper arms on top of the preacher bench or the incline bench. The dumbbells should be held at shoulder height and the elbows should be flexed. Hold the dumbbells with the palms of your hands facing down. This will be your starting position. As you breathe in, slowly lower the dumbbells keeping the palms down until your upper arm is extended and your biceps are fully stretched. Now rotate your wrists once you are at the bottom of the movement so that the palms of the hands are facing up. As you exhale, use your biceps to curl the weights up until they are fully contracted and the dumbbells are at shoulder height. Again, remember that to ensure full contraction you need to bring that small finger higher than the thumb. Squeeze the biceps hard for a second at the contracted position and rotate your wrists so that the palms are facing down again. Repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/lhehKNsSl3A"
      },
    {
         "Exercise":"cable wrist curl",
         "Descriptions":"Start out by placing a flat bench in front of a low pulley cable that has a straight bar attachment. Use your arms to grab the cable bar with a narrow to shoulder width supinated grip (palms up) and bring them up so that your forearms are resting against the top of your thighs. Your wrists should be hanging just beyond your knees. Start out by curling your wrist upwards and exhaling. Keep the contraction for a second. Slowly lower your wrists back down to the starting position while inhaling. Your forearms should be stationary as your wrist is the only movement needed to perform this exercise. Repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/riolKbyWpWk"
      },
      {
         "Exercise":"dumbbell lying pronation",
         "Descriptions":"Lie on a flat bench face down with one arm holding a dumbbell and the other hand on top of the bench folded so that you can rest your head on it. Bend the elbows of the arm holding the dumbbell so that it creates a 90-degree angle between the upper arm and the forearm. Now raise the upper arm so that the forearm is perpendicular to the floor and the upper arm is perpendicular to your torso. Tip: The upper arm should be parallel to the floor and also creating a 90-degree angle with your torso. This will be your starting position. As you breathe out, externally rotate your forearm so that the dumbbell is lifted forward as you maintain the 90 degree angle bend between the upper arms and the forearm. You will continue this external rotation until the forearm is parallel to the floor. At this point you will hold the contraction for a second. As you breathe in, slowly go back to the starting position. Repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/M_pkj9o2cnM"
      },
      {
         "Exercise":"dumbbell lying supination",
         "Descriptions":"Lie sideways on a flat bench with one arm holding a dumbbell and the other hand on top of the bench folded so that you can rest your head on it. Bend the elbows of the arm holding the dumbbell so that it creates a 90-degree angle between the upper arm and the forearm. Now raise the upper arm so that the forearm is parallel to the floor and perpendicular to your torso (Tip: So the forearm will be directly in front of you). The upper arm will be stationary by your torso and should be parallel to the floor (aligned with your torso at all times). This will be your starting position. As you breathe out, externally rotate your forearm so that the dumbbell is lifted up in a semicircle motion as you maintain the 90 degree angle bend between the upper arms and the forearm. You will continue this external rotation until the forearm is perpendicular to the floor and the torso pointing towards the ceiling. At this point you will hold the contraction for a second. As you breathe in, slowly go back to the starting position. Repeat for the recommended amount of repetitions and then switch to the other arm. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/7UYO_pWSQNQ"
      },
      {
         "Exercise":"farmer's walk",
         "Descriptions":"There are various implements that can be used for the farmers walk. These can also be performed with heavy dumbbells or short bars if these implements aren't available. Begin by standing between the implements. After gripping the handles, lift them up by driving through your heels, keeping your back straight and your head up. Walk taking short, quick steps, and don't forget to breathe. Move for a given distance, typically 50-100 feet, as fast as possible. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/Fkzk_RqlYig"
      },
      {
         "Exercise":"finger curls",
         "Descriptions":"Hold a barbell with both hands and your palms facing up; hands spaced about shoulder width. Place your feet flat on the floor, at a distance that is slightly wider than shoulder width apart. This will be your starting position. Lower the bar as far as possible by extending the fingers. Allowing the bar to roll down the hands, catch the bar with the final joint in the fingers. Now curl bar up as high as possible by closing your hands while exhaling. Hold the contraction at the top. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/mp61xNRZcrk"
      },
      {
         "Exercise":"palms-down wrist curl over a bench",
         "Descriptions":"Start out by placing a barbell on one side of a flat bench. Kneel down on both of your knees so that your body is facing the flat bench. Use your arms to grab the barbell with a pronated grip (palms down) and bring them up so that your forearms are resting against the flat bench. Your wrists should be hanging over the edge. Start out by curling your wrist upwards and exhaling. Slowly lower your wrists back down to the starting position while inhaling. Your forearms should be stationary as your wrist is the only movement needed to perform this exercise. Repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/sf9c-iQxRzw"
      },
      {
         "Exercise":"palms-up dumbbell wrist curl over a bench",
         "Descriptions":"Start out by placing two dumbbells on one side of a flat bench. Kneel down on both of your knees so that your body is facing the flat bench. Use your arms to grab both of the dumbbells with a supinated grip (palms up) and bring them up so that your forearms are resting against the flat bench. Your wrists should be hanging over the edge. Start out by curling your wrist upwards and exhaling. Slowly lower your wrists back down to the starting position while inhaling. Make sure to inhale during this part of the exercise. Your forearms should be stationary as your wrist is the only movement needed to perform this exercise. Repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/R5A5ODRSLXo"
      },
      {
         "Exercise":"plate pinch",
         "Descriptions":"Grab two wide-rimmed plates and put them together with the smooth sides facing outward Use your fingers to grip the outside part of the plate and your thumb for the other side thus holding both plates together. This is the starting position. Squeeze the plate with your fingers and thumb. Hold this position for as long as you can. Repeat for the recommended amount of sets prescribed in your program. Switch arms and repeat the movements. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/vNbatvOweWw"
      },
      {
         "Exercise":"rickshaw carry",
         "Descriptions":"Position the frame at the starting point, and load with the appropriate weight. Standing in the center of the frame, begin by gripping the handles and driving through your heels to lift the frame. Ensure your chest and head are up and your back is straight. Immediately begin walking briskly with quick, controlled steps. Keep your chest up and head forward, and make sure you continue breathing. Bring the frame to the ground after you have reached the end point. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/oytPQLjG84k"
      },
      {
         "Exercise":"seated dumbbell palms-up wrist curl",
         "Descriptions":"Start out by placing two dumbbells on the floor in front of a flat bench. Sit down on the edge of the flat bench with your legs at about shoulder width apart. Make sure to keep your feet on the floor. Use your arms to grab both of the dumbbells and bring them up so that your forearms are resting against your thighs with the palms of the hands facing up. Your wrists should be hanging over the edge of your thighs. Start out by curling your wrist upwards and exhaling. Slowly lower your wrists back down to the starting position while inhaling. Make sure to inhale during this part of the exercise. Tip: Your forearms should be stationary as your wrist is the only movement needed to perform this exercise. Repeat for the recommended amount of repetitions. When finished, simply lower the dumbbells to the floor. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/ynLcVyaYEuc"
      },
      {
         "Exercise":"seated one-arm dumbbell palms-up wrist curl",
         "Descriptions":"Sit on a flat bench with a dumbbell in your right hand. Place your feet flat on the floor, at a distance that is slightly wider than shoulder width apart. Lean forward and place your right forearm on top of your upper right thigh with your palm up. Tip: Make sure that the front of the wrist lies on top of your knees. This will be your starting position. Lower the dumbbell as far as possible as you keep a tight grip on the dumbbell. Inhale as you perform this movement. Now curl the dumbbell as high as possible as you contract the forearms and as you exhale. Keep the contraction for a second before you lower again. Tip: The only movement should happen at the wrist. Perform for the recommended amount of repetitions, switch arms and repeat the movement. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/j5zUwxJETRw&"
      },
      {
         "Exercise":"seated palm-up barbell wrist curl",
         "Descriptions":"Hold a barbell with both hands and your palms facing up; hands spaced about shoulder width. Place your feet flat on the floor, at a distance that is slightly wider than shoulder width apart. Lean forward and place your forearms on top of your upper thighs with your palms up. Tip: Make sure that the front of the wrists lay on top of your knees. This will be your starting position. Lower the bar as far as possible while inhaling and keeping a tight grip. Now curl bar up as high as possible while flexing the forearms and exhaling. Hold the contraction at the top for a second and Tip: Only the wrist should move. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/j5zUwxJETRw"
      },
      {
         "Exercise":"seated two-arm palms-up low-pulley wrist curl",
         "Descriptions":"Put a bench in front of a low pulley machine that has a barbell or EZ Curl attachment on it. Move the bench far enough away so that when you bring the handle to the top of your thighs tension is created on the cable due to the weight stack being moved up. Now hold the handle with both hands, palms up, using a shoulder-width grip. Step back and sit on the bench with your feet about shoulder width apart, firmly on the floor. Lean forward and place the forearms on your thighs with the back of your wrists over your knees. This will be your starting position. Lower the bar as far as possible, while inhaling and keeping a tight grip. Now curl the bar up as high as possible while contracting the forearms. Tip: Only the wrist should move; not the forearms. After a second contraction at the top go back to the starting position as you inhale. Repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/Lg2FmtkmgCs"
      },
      {
         "Exercise":"standing palms-up barbell behind the back wrist curl",
         "Descriptions":"Start by standing straight and holding a barbell behind your glutes at arm's length while using a pronated grip (palms will be facing back away from the glutes) and having your hands shoulder width apart from each other. You should be looking straight forward while your feet are shoulder width apart from each other. This is the starting position. While exhaling, slowly elevate the barbell up by curling your wrist in a semi-circular motion towards the ceiling. Note: Your wrist should be the only body part moving for this exercise. Hold the contraction for a second and lower the barbell back down to the starting position while inhaling. Repeat for the recommended amount of repetitions. When finished, lower the barbell down to the squat rack or the floor by bending the knees. Tip: It is easiest to either pick it up from a squat rack or have a partner hand it to you. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/06lPIknOKiE"
      },
      {
         "Exercise":"wrist roller",
         "Descriptions":"To begin, stand straight up grabbing a wrist roller using a pronated grip (palms facing down). Your feet should be shoulder width apart. Slowly lift both arms until they are fully extended and parallel to the floor in front of you. Note: Make sure the rope is not wrapped around the roller. Your entire body should be stationary except for the forearms. This is the starting position. Rotate one wrist at a time in an upward motion to bring the weight up to the bar by rolling the rope around the roller. Once the weight has reached the bar, slowly begin to lower the weight back down by rotating the wrist in a downward motion until the weight reaches the starting position. Repeat for the prescribed amount of repetitions in your program. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/8tp9Ufk9Hcg"
      },
      {
         "Exercise":"alternating cable shoulder press",
         "Descriptions":"Move the cables to the bottom of the tower and select an appropriate weight. Grasp the cables and hold them at shoulder height, palms facing forward. This will be your starting position. Keeping your head and chest up, extend through the elbow to press one side directly over head. After pausing at the top, return to the starting position and repeat on the opposite side. Alternative Exercises for Alternating Cable Shoulder Press Dumbbell Shoulder Press thumbnail image Dumbbell Shoulder Press thumbnail image Dumbbell Shoulder Press Muscle Targeted: Shoulders Equipment Type: Dumbbell 9 Excellent Kettlebell Seated Press thumbnail image Kettlebell Seated Press thumbnail image Kettlebell Seated Press Muscle Targeted: Shoulders Equipment Type: Kettlebells 7 Good Kettlebell Thruster thumbnail image Kettlebell Thruster thumbnail image Kettlebell Thruster Muscle Targeted: Shoulders Equipment Type: Kettlebells 8.6 Excellent  ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/WavRTa4vl8c"
      },
      {
         "Exercise":"alternating kettlebell press",
         "Descriptions":"Clean two kettlebells to your shoulders. Clean the kettlebells to your shoulders by extending through the legs and hips as you pull the kettlebells towards your shoulders. Rotate your wrists as you do so. Press one directly overhead by extending through the elbow, turning it so the palm faces forward while holding the other kettlebell stationary . Lower the pressed kettlebell to the starting position and immediately press with your other arm. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/o9z9F4V5yTw"
      },
      {
         "Exercise":"anti-gravity press",
         "Descriptions":"Place a bar on the ground behind the head of an incline bench. Lay on the bench face down. With a pronated grip, pick the barbell up from the floor. Flex the elbows, performing a reverse curl to bring the bar near your chest. This will be your starting position. To begin, press the barbell out in front of your head by extending your elbows. Keep your arms parallel to the ground throughout the movement. Return to the starting position and repeat to complete the set. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/HXbetYIM-AY"
      },
      {
         "Exercise":"arnold dumbbell press",
         "Descriptions":"Sit on an exercise bench with back support and hold two dumbbells in front of you at about upper chest level with your palms facing your body and your elbows bent. Tip: Your arms should be next to your torso. The starting position should look like the contracted portion of a dumbbell curl. Now to perform the movement, raise the dumbbells as you rotate the palms of your hands until they are facing forward. Continue lifting the dumbbells until your arms are extended above you in straight arm position. Breathe out as you perform this portion of the movement. After a second pause at the top, begin to lower the dumbbells to the original position by rotating the palms of your hands towards you. Tip: The left arm will be rotated in a counter clockwise manner while the right one will be rotated clockwise. Breathe in as you perform this portion of the movement. Repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/X60-yTMOJfw"
      },
      {
         "Exercise":"band pull apart",
         "Descriptions":"Begin with your arms extended straight out in front of you, holding the band with both hands. Initiate the movement by performing a reverse fly motion, moving your hands out laterally to your sides. Keep your elbows extended as you perform the movement, bringing the band to your chest. Ensure that you keep your shoulders back during the exercise. Pause as you complete the movement, returning to the starting position under control. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/BVehf-8FAxQ"
      },
      {
         "Exercise":"barbell incline shoulder raise",
         "Descriptions":"Lie back on an Incline Bench. Using a medium width grip (a grip that is slightly wider than shoulder width), lift the bar from the rack and hold it straight over you with your arms straight. This will be your starting position. While keeping the arms straight, lift the bar by protracting your shoulder blades, raising the shoulders from the bench as you breathe out. Bring back the bar to the starting position as you breathe in. Repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/dpm9C41j0G0"
      },
      {
         "Exercise":"barbell rear delt row",
         "Descriptions":"Stand up straight while holding a barbell using a wide (higher than shoulder width) and overhand (palms facing your body) grip. Bend knees slightly and bend over as you keep the natural arch of your back. Let the arms hang in front of you as they hold the bar. Once your torso is parallel to the floor, flare the elbows out and away from your body. Tip: Your torso and your arms should resemble the letter T. Now you are ready to begin the exercise. While keeping the upper arms perpendicular to the torso, pull the barbell up towards your upper chest as you squeeze the rear delts and you breathe out. Tip: When performed correctly, this exercise should resemble a bench press in reverse. Also, refrain from using your biceps to do the work. Focus on targeting the rear delts; the arms should only act as hooks. Slowly go back to the initial position as you breathe in. Repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/XagV4XfG9fo"
      },
      {
         "Exercise":"battling ropes",
         "Descriptions":"For this exercise you will need a heavy rope anchored at its center 15-20 feet away. Standing in front of the rope, take an end in each hand with your arms extended at your side. This will be your starting position. Initiate the movement by rapidly raising one arm to shoulder level as quickly as you can. As you let that arm drop to the starting position, raise the opposite side. Continue alternating your left and right arms, whipping the ropes up and down as fast as you can. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/__bv4D7ii_0"
      },
      {
         "Exercise":"bent over dumbbell rear delt raise with head on bench",
         "Descriptions":"Stand up straight while holding a dumbbell in each hand and with an incline bench in front of you. While keeping your back straight and maintaining the natural arch of your back, lean forward until your forehead touches the bench in front of you. Let the arms hang in front of you perpendicular to the ground. The palms of your hands should be facing each other and your torso should be parallel to the floor. This will be your starting position. Keeping your torso forward and stationary, and the arms straight with a slight bend at the elbows, lift the dumbbells straight to the side until both arms are parallel to the floor. Exhale as you lift the weights. Caution: avoid swinging the torso or bringing the arms back as opposed to the side. After a one second contraction at the top, slowly lower the dumbbells back to the starting position. Repeat the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/AVe_UxOrdaY"
      },
      {
         "Exercise":"bradford/rocky presses",
         "Descriptions":"Sit on a Military Press Bench with a bar at shoulder level with a pronated grip (palms facing forward). Tip: Your grip should be wider than shoulder width and it should create a 90-degree angle between the forearm and the upper arm as the barbell goes down. This is your starting position. Once you pick up the barbell with the correct grip, lift the bar up over your head by locking your arms. Now lower the bar down to the back of the head slowly as you inhale. Lift the bar back up to the starting position as you exhale. Lower the bar down to the starting position slowly as you inhale. This is one repetition. Alternate in this manner until you complete the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/GEk3HtY9dCg"
      },
      {
         "Exercise":"cable internal rotation",
         "Descriptions":"Sit next to a low pulley sideways (with legs stretched in front of you or crossed) and grasp the single hand cable attachment with the arm nearest to the cable. Tip: If you can adjust the pulley™s height, you can use a flat bench to sit on instead. Position the elbow against your side with the elbow bent at 90 degrees and the arm pointing towards the pulley. This will be your starting position. Pull the single hand cable attachment toward your body by internally rotating your shoulder until your forearm is across your abs. You will be creating an imaginary semi-circle. Tip: The forearm should be perpendicular to your torso at all times. Slowly go back to the initial position. Repeat for the recommended amount of repetitions and then repeat the movement with the next arm. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/21SAIKauNt0"
      },
      {
         "Exercise":"cable rear delt fly",
         "Descriptions":"Adjust the pulleys to the appropriate height and adjust the weight. The pulleys should be above your head. Grab the left pulley with your right hand and the right pulley with your left hand, crossing them in front of you. This will be your starting position. Initiate the movement by moving your arms back and outward, keeping your arms straight as you execute the movement. Pause at the end of the motion before returning the handles to the start position. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/RfDQqZPTzt8"
      },
      {
         "Exercise":"cable seated lateral raise",
         "Descriptions":"Stand in the middle of two low pulleys that are opposite to each other and place a flat bench right behind you (in perpendicular fashion to you; the narrow edge of the bench should be the one behind you). Select the weight to be used on each pulley. Now sit at the edge of the flat bench behind you with your feet placed in front of your knees. Bend forward while keeping your back flat and rest your torso on the thighs. Have someone give you the single handles attached to the pulleys. Grasp the left pulley with the right hand and the right pulley with the left after you select your weight. The pulleys should run under your knees and your arms will be extended with palms facing each other and a slight bend at the elbows. This will be the starting position. While keeping the arms stationary, raise the upper arms to the sides until they are parallel to the floor and at shoulder height. Exhale during the execution of this movement and hold the contraction for a second. Slowly lower your arms to the starting position as you inhale. Repeat for the recommended amount of repetitions. Tip: Maintain upper arms perpendicular to torso and a fixed elbow position (10 degree to 30 degree angle) throughout exercise. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/8qsltQgT4ag"
      },
      {
         "Exercise":"car drivers",
         "Descriptions":"While standing upright, hold a barbell plate in both hands at the 3 and 9 o'clock positions. Your palms should be facing each other and your arms should be extended straight out in front of you. This will be your starting position. Initiate the movement by rotating the plate as far to one side as possible. Use the same type of movement you would use to turn a steering wheel to one side. Reverse the motion, turning it all the way to the opposite side. Repeat for the recommended amount of repetitions.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/IV_QZ4gmUUQ"
      },
      {
         "Exercise":"clean and press",
         "Descriptions":"Assume a shoulder-width stance, with knees inside the arms. Now while keeping the back flat, bend at the knees and hips so that you can grab the bar with the arms fully extended and a pronated grip that is slightly wider than shoulder width. Point the elbows out to sides. The bar should be close to the shins. Position the shoulders over or slightly ahead of the bar. Establish a flat back posture. This will be your starting position. Begin to pull the bar by extending the knees. Move your hips forward and raise the shoulders at the same rate while keeping the angle of the back constant; continue to lift the bar straight up while keeping it close to your body. As the bar passes the knee, extend at the ankles, knees, and hips forcefully, similar to a jumping motion. As you do so, continue to guide the bar with your hands, shrugging your shoulders and using the momentum from your movement to pull the bar as high as possible. The bar should travel close to your body, and you should keep your elbows out. At maximum elevation, your feet should clear the floor and you should start to pull yourself under the bar. The mechanics of this could change slightly, depending on the weight used. You should descend into a squatting position as you pull yourself under the bar. As the bar hits terminal height, rotate your elbows around and under the bar. Rack the bar across the front of the shoulders while keeping the torso erect and flexing the hips and knees to absorb the weight of the bar. Stand to full height, holding the bar in the clean position. Without moving your feet, press the bar overhead as you exhale. Lower the bar under control  ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/pajZn-M-r4Q"
      },
      {
         "Exercise":"double kettlebell push press",
         "Descriptions":"Clean two kettlebells to your shoulders. Squat down a few inches and reverse the motion rapidly. Use the momentum from the legs to drive thekettlebells overhead. Once the kettlebells are locked out, lower the kettlebells to your shoulders and repeat.  ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/K2X8qG3I690"
      },
      {
         "Exercise":"dumbbell shoulder press",
         "Descriptions":"While holding a dumbbell in each hand, sit on a military press bench or utility bench that has back support. Place the dumbbells upright on top of your thighs. Now raise the dumbbells to shoulder height one at a time using your thighs to help propel them up into position. Make sure to rotate your wrists so that the palms of your hands are facing forward. This is your starting position. Now, exhale and push the dumbbells upward until they touch at the top. Then, after a brief pause at the top contracted position, slowly lower the weights back down to the starting position while inhaling. Repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/qEwKCR5JCog"
      },
      {
         "Exercise":"external rotation",
         "Descriptions":"Lie sideways on a flat bench with one arm holding a dumbbell and the other hand on top of the bench folded so that you can rest your head on it. Bend the elbows of the arm holding the dumbbell so that it creates a 90-degree angle between the upper arm and the forearm. Tip: Keep the arm parallel to your torso. Now bend the elbow while keeping the upper arm stationary. In this manner, the forearm will be parallel to the floor and perpendicular to your torso (Tip: So the forearm will be directly in front of you). The upper arm will be stationary by your torso and should be parallel to the floor (aligned with your torso at all times). This will be your starting position. As you breathe out, externally rotate your forearm so that the dumbbell is lifted up in a semicircle motion as you maintain the 90 degree angle bend between the upper arms and the forearm. You will continue this external rotation until the forearm is perpendicular to the floor and the torso pointing towards the ceiling. At this point you will hold the contraction for a second. As you breathe in, slowly go back to the starting position. Repeat for the recommended amount of repetitions and then switch to the other arm. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/uFnx9sA_LCs"
      },
      {
         "Exercise":"external rotation with cable",
         "Descriptions":"Adjust the cable to the same height as your elbow. Stand with your left side to the band a couple of feet away. Grasp the handle with your right hand, and keep your elbow pressed firmly to your side. We recommend you hold a pad or foam roll in place with your elbow to keep it firmly in position. With your upper arm in position, your elbow should be flexed to 90 degrees with your hand reaching across the front of your torso. This will be your starting position. Execute the movement by rotating your arm in a backhand motion, keeping your elbow in place. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/LpNgc6Vx4iY"
      },
      {
         "Exercise":"front cable raise",
         "Descriptions":"Select the weight on a low pulley machine and grasp the single hand cable attachment that is attached to the low pulley with your left hand. Face away from the pulley and put your arm straight down with the hand cable attachment in front of your thighs at arms' length with the palms of the hand facing your thighs. This will be your starting position. While maintaining the torso stationary (no swinging), lift the left arm to the front with a slight bend on the elbow and the palms of the hand always faces down. Continue to go up until you arm is slightly above parallel to the floor. Exhale as you execute this portion of the movement and pause for a second at the top. Now as you inhale lower the arm back down slowly to the starting position. Once all of the recommended amount of repetitions have been performed for this arm, switch arms and perform the exercise with the right one. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/2SlOLS4xYkQ"
      },
      {
         "Exercise":"front dumbbell raise",
         "Descriptions":"Pick a couple of dumbbells and stand with a straight torso and the dumbbells on front of your thighs at arms length with the palms of the hand facing your thighs. This will be your starting position. While maintaining the torso stationary (no swinging), lift the left dumbbell to the front with a slight bend on the elbow and the palms of the hands always facing down. Continue to go up until you arm is slightly above parallel to the floor. Exhale as you execute this portion of the movement and pause for a second at the top. Inhale after the second pause. Now lower the dumbbell back down slowly to the starting position as you simultaneously lift the right dumbbell. Continue alternating in this fashion until all of the recommended amount of repetitions have been performed for each arm.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/-t7fuZ0KhDA"
      },
      {
         "Exercise":"internal rotation with band",
         "Descriptions":"Choke the band around a post. The band should be at the same height as your elbow. Stand with your right side to the band a couple of feet away. Grasp the end of the band with your right hand, and keep your elbow pressed firmly to your side. We recommend you hold a pad or foam roll in place with your elbow to keep it firmly in position. With your upper arm in position, your elbow should be flexed to 90 degrees with your hand reaching away from your torso. This will be your starting position. Execute the movement by rotating your arm in a forehand motion, keeping your elbow in place. Continue as far as you are able, pause, and then return to the starting position. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/sL7fvQ2DuGE"
      },
      {
         "Exercise":"kettlebell arnold press",
         "Descriptions":"Clean a kettlebell to your shoulder. Clean the kettlebell to your shoulder by extending through the legs and hips as you raise the kettlebell towards your shoulder. The palm should be facing inward. Looking straight ahead, press the kettlebell out and overhead, rotating your wrist so that your palm faces forward at the top of the motion. Return the kettlebell to the starting position, with the palm facing in. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/N-CRk7aexBs"
      },
      {
         "Exercise":"kettlebell pirate ships",
         "Descriptions":"With a wide stance, hold a kettlebell with both hands. Allow it to hang at waist level with your arms extended. This will be your starting position. Initiate the movement by turning to one side, swinging the kettlebell to head height. Briefly pause at the top of the motion. Allow the bell to drop as you rotate to the opposite side, again raising the kettlebell to head height. Repeat for the desired amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/8dC7UssgqZw"
      },
      {
         "Exercise":"kettlebell seated press",
         "Descriptions":"Sit on the floor and spread your legs out comfortably. Clean one kettlebell to your shoulder. Press the kettlebell up and out until it is locked out overhead. Return to the starting position. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/Pn4taeZH3GU"
      },
      {
         "Exercise":"kneeling arm drill",
         "Descriptions":"This drill helps increase arm efficiency during the run. Begin kneeling, left foot in front, right knee down. Apply pressure through the front heel to keep your glutes and hamstrings activated. Begin by blocking the arms in long, pendulum like swings. Close the arm angle, blocking with the arms as you would when jogging, progressing to a run and finally a sprint. As soon as your hands pass the hip, accelerate them forward during the sprinting motion to move them as quickly as possible. Switch knees and repeat. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/ITF1Bhe1HqY"
      },
      {
         "Exercise":"landmine linear jammer",
         "Descriptions":"Position a bar into a landmine or securely anchor it in a corner. Load the bar to an appropriate weight. Raise the bar from the floor, taking it to your shoulders with one or both hands. Adopt a wide stance. This will be your starting position. Perform the movement by extending the elbow, pressing the weight up. Move explosively, extending the hips and knees fully to produce maximal force. Return to the starting position. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/kXBFR5UaOAk"
      },
      {
         "Exercise":"lateral raise - with bands",
         "Descriptions":"To begin, stand on an exercise band so that tension begins at arm's length. Grasp the handles using a pronated (palms facing your thighs) grip that is slightly less than shoulder width. The handles should be resting on the sides of your thighs. Your arms should be extended with a slight bend at the elbows and your back should be straight. This will be your starting position. Use your side shoulders to lift the handles to the sides as you exhale. Continue to lift the handles until they are slightly above parallel. Tip: As you lift the handles, slightly tilt the hand as if you were pouring water and keep your arms extended. Also, keep your torso stationary and pause for a second at the top of the movement. Lower the handles back down slowly to the starting position. Inhale as you perform this portion of the movement. Repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/o4WUY6vSaGE"
      },
      {
         "Exercise":"leverage shoulder press",
         "Descriptions":"Load an appropriate weight onto the pins and adjust the seat for your height. The handles should be near the top of the shoulders at the beginning of the motion. Your chest and head should be up and handles held with a pronated grip. This will be your starting position. Press the handles upward by extending through the elbow. After a brief pause at the top, return the weight to just above the start position, keeping tension on the muscles by not returning the weight to the stops until the set is complete. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/blzX_s29g8k"
      },
      {
         "Exercise":"low pulley row to neck",
         "Descriptions":"Sit on a low pulley row machine with a rope attachment. Grab the ends of the rope using a palms-down grip and sit with your back straight and your knees slightly bent. Tip: Keep your back almost completely vertical and your arms fully extended in front of you. This will be your starting position. While keeping your torso stationary, lift your elbows and start bending them as you pull the rope towards your neck while exhaling. Throughout the movement your upper arms should remain parallel to the floor. Tip: Continue this motion until your hands are almost next to your ears (the forearms will not be parallel to the floor at the end of the movement as they will be angled a bit upwards) and your elbows are out away from your sides. After holding for a second or so at the contracted position, come back slowly to the starting position as you inhale. Tip: Again, during no part of the movement should the torso move. Repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/8ihFcyX_kWo"
      },
      {
         "Exercise":"lying one-arm lateral raise",
         "Descriptions":"While holding a dumbbell in one hand, lay with your chest down on a flat bench. The other hand can be used to hold to the leg of the bench for stability. Position the palm of the hand that is holding the dumbbell in a neutral manner (palms facing your torso) as you keep the arm extended with the elbow slightly bent. This will be your starting position. Now raise the arm with the dumbbell to the side until your elbow is at shoulder height and your arm is roughly parallel to the floor as you exhale. Tip: Maintain your arm perpendicular to the torso while keeping your arm extended throughout the movement. Also, keep the contraction at the top for a second. Slowly lower the dumbbell to the starting position as you inhale. Repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/VqFAWmgnb8I"
      },
      {
         "Exercise":"lying rear delt raise",
         "Descriptions":"While holding a dumbbell in each hand, lay with your chest down on a flat bench. Position the palms of the hands in a neutral manner (palms facing your torso) as you keep the arms extended with the elbows slightly bent. This will be your starting position. Now raise the arms to the side until your elbows are at shoulder height and your arms are roughly parallel to the floor as you exhale. Tip: Maintain your arms perpendicular to the torso while keeping them extended throughout the movement. Also, keep the contraction at the top for a second. Slowly lower the dumbbells to the starting position as you inhale. Repeat for the recommended amount of repetitions and then switch to the other arm. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/ovsIM1zc6lQ"
      },
      {
         "Exercise":"one-arm incline lateral raise",
         "Descriptions":"Lie down sideways on an incline bench press with a dumbbell in the hand. Make sure the shoulder is pressing against the incline bench and the arm is lying across your body with the palm around your navel. Hold a dumbbell in your uppermost arm while keeping it extended in front of you parallel to the floor. This is your starting position. While keeping the dumbbell parallel to the floor at all times, perform a lateral raise. Your arm should travel straight up until it is pointing at the ceiling. Tip: Exhale as you perform this movement. Hold the dumbbell in the position and feel the contraction in the shoulders for a second. While inhaling lower the weight across your body back into the starting position. Repeat the movement for the prescribed amount of repetitions. Switch arms and repeat the movement. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/6I6AlMABLL8"
      },
      {
         "Exercise":"one-arm kettlebell clean and jerk",
         "Descriptions":"Hold a kettlebell by the handle. Clean the kettlebell to your shoulder by extending through the legs and hips as you pull the kettlebell towards your shoulder. Rotate your wrist as you do so, so that the palm faces forward. Dip your body by bending the knees, keeping your torso upright. Immediately reverse direction, driving through the heels, in essence jumping to create momentum. As you do so, press the kettlebell overhead to lockout by extending the arms, using your body's momentum to move the weight. Receive the weight overhead by returning to a squat position underneath the weight. Keeping the weight overhead, return to a standing position. Lower the weight to the floor to perform the next repetition. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/DGql83eyHRE"
      },
      {
         "Exercise":"one-arm kettlebell jerk",
         "Descriptions":"Hold a kettlebell by the handle. Clean the kettlebell to your shoulder by extending through the legs and hips as you pull the kettlebell towards your shoulder. Rotate your wrist as you do so, so that the palm faces forward. This will be your starting position. Dip your body by bending the knees, keeping your torso upright. Immediately reverse direction, driving through the heels, in essence jumping to create momentum. As you do so, press the kettlebell overhead to lockout by extending the arms, using your body's momentum to move the weight. Receive the weight overhead by returning to a squat position underneath the weight. Keeping the weight overhead, return to a standing position. Lower the weight to perform the next repetition. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/6AIlgwod8cY"
      },
      {
         "Exercise":"one-arm kettlebell para press",
         "Descriptions":" ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/sj8fo4DlrSg"
      },
      {
         "Exercise":"one-arm kettlebell split jerk",
         "Descriptions":" ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/hT9isVsABy0"
      },
      {
         "Exercise":"one-arm side laterals",
         "Descriptions":"Clean a kettlebell to your shoulder. Clean the kettlebell to your shoulder by extending through the legs and hips as you pull the kettlebell towards your shoulder. Rotate your wrist as you do so, so that the palm faces forward. This will be your starting position. Hold the kettlebell with the elbow out to the side, and press it up and out until it is locked out overhead. Lower the kettlebell back to your shoulder under control and repeat. Make sure to contract your lat, butt, and stomach forcefully for added stability and strength. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/acVqjSClHj0"
      },
      {
         "Exercise":"power partials",
         "Descriptions":"Stand up with your torso upright and a dumbbell on each hand being held at arms length. The elbows should be close to the torso. The palms of the hands should be facing your torso. Your feet should be about shoulder width apart. This will be your starting position. Keeping your arms straight and the torso stationary, lift the weights out to your sides until they are about shoulder level height while exhaling. Feel the contraction for a second and begin to lower the weights back down to the starting position while inhaling. Tip: Keep the palms facing down with the little finger slightly higher while lifting and lowering the weights as it will concentrate the stress on your shoulders mainly. Repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/YhLCcz8CbaY"
      },
      {
         "Exercise":"push press - behind the neck",
         "Descriptions":"Standing with the weight racked on the back of the shoulders, begin with the dip. With your feet directly under your hips, flex the knees without moving the hips backward. Go down only slightly, and reverse direction as powerfully as possible. Drive through the heels create as much speed and force as possible, moving the bar in a vertical path. Using the momentum generated, finish pressing the weight overhead be extending through the arms. Return to the starting position, using your legs to absorb the impact. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/O_bfezrhgH4"
      },
      {
         "Exercise":"rack delivery",
         "Descriptions":" This drill teaches the delivery of the barbell to the rack position on the shoulders. Begin holding a bar in the scarecrow position, with the upper arms parallel to the floor, and the forearms hanging down. Use a hook grip, with your fingers wrapped over your thumbs. Begin by rotating the elbows around the bar, delivering the bar to the shoulders. As your elbows come forward, relax your grip. The shoulders should be protracted, providing a shelf for the bar, which should lightly contact the throat. It is important that the bar stay close to the body at all times, as with a heavier load any distance will result in an unwanted collision. As the movement becomes smoother, speed and load can be increased before progressing further.  ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/UbogyZKLA14"
      },
      {
         "Exercise":"reverse flyes with external rotation",
         "Descriptions":"To begin, lie down on an incline bench set at a 30-degree angle with the chest and stomach pressing against the incline. Have the dumbbells in each hand with the palms facing down to the floor. Your arms should be in front of you so that they are perpendicular to the angle of the bench. Tip: Your elbows should have a slight bend. The legs should be stationary while applying pressure with the ball of your toes (your heels should not be touching the floor). This is the starting position. Maintaining the slight bend of the elbows, move the weights out and away from each other in an arc motion while exhaling. As you lift the weight, your wrist should externally rotate by 90-degrees so that you go from a palms down (pronated) grip to a palms facing each other (neutral) grip. Tip: Try to squeeze your shoulder blades together to get the best results from this exercise. The arms should be elevated until they are level with the head. Feel the contraction and slowly lower the weights back down to the starting position while inhaling. Repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/dOFmtsNtjsU"
      },
      {
         "Exercise":"reverse machine flyes",
         "Descriptions":"Adjust the handles so that they are fully to the rear. Make an appropriate weight selection and adjust the seat height so the handles are at shoulder level. Grasp the handles with your hands facing inwards. This will be your starting position. In a semicircular motion, pull your hands out to your side and back, contracting your rear delts. Keep your arms slightly bent throughout the movement, with all of the motion occurring at the shoulder joint. Pause at the rear of the movement, and slowly return the weight to the starting position. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/nnn9kg33K2g"
      },
      {
         "Exercise":"round the world shoulder stretch",
         "Descriptions":" Stand up straight with your legs together, holding a bodybar or broomstick. Hold the pole behind your hips with a wider than shoulder width grip. Your palms should be down and your thumbs facing out. Slowly lift your arms up behind your head. Don't force it if it gets hard to lift further.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/3PH6Qxx_dJI"
      },
      {
         "Exercise":"seated barbell military press",
         "Descriptions":" Sit on a Military Press Bench with a bar behind your head and either have a spotter give you the bar (better on the rotator cuff this way) or pick it up yourself carefully with a pronated grip (palms facing forward). Tip: Your grip should be wider than shoulder width and it should create a 90-degree angle between the forearm and the upper arm as the barbell goes down. Once you pick up the barbell with the correct grip length, lift the bar up over your head by locking your arms. Hold at about shoulder level and slightly in front of your head. This is your starting position. Lower the bar down to the collarbone slowly as you inhale. Lift the bar back up to the starting position as you exhale. Repeat for the recommended amount of repetitions.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/ECWxumBMLVQ"
      },
      {
         "Exercise":"seated front deltoid",
         "Descriptions":"Sit upright on the floor with your legs bent, your partner standing behind you. Stick your arms straight out to your sides, with your palms facing the ground. Attempt to move them as far behind you as possible, as your assistant holds your wrists. This will be your starting position. Keeping your elbows straight, attempt to move your arms to the front, with your partner gently restraining you to prevent any actual movement for 10-20 seconds. Now, relax your muscles and allow your partner to gently increase the stretch on the shoulders and chest. Hold for 10 to 20 seconds. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/mxV83nfEy-w"
      },
      {
         "Exercise":"seated side lateral raise",
         "Descriptions":"Pick a couple of dumbbells and sit at the end of a flat bench with your feet firmly on the floor. Hold the dumbbells with your palms facing in and your arms straight down at your sides at arms' length. This will be your starting position. While maintaining the torso stationary (no swinging), lift the dumbbells to your side with a slight bend on the elbow and the hands slightly tilted forward as if pouring water in a glass. Continue to go up until you arms are parallel to the floor. Exhale as you execute this movement and pause for a second at the top. Lower the dumbbells back down slowly to the starting position as you inhale. Repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/JVC6u_lsqvk"
      },
      {
         "Exercise":"shoulder press - with bands",
         "Descriptions":"To begin, stand on an exercise band so that tension begins at arm's length. Grasp the handles and lift them so that the hands are at shoulder height at each side. Rotate the wrists so that the palms of your hands are facing forward. Your elbows should be bent, with the upper arms and forearms in line to the torso. This is your starting position. As you exhale, lift the handles up until your arms are fully extended overhead. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/JMZxrSRpGhw"
      },
      {
         "Exercise":"shoulder stretch",
         "Descriptions":"Reach your left arm across your body and hold it straight. With your right hand, grasp your left elbow and pull it across your body towards your chest.  ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/KBLsNbolr_c"
      },
      {
         "Exercise":"side lateral raise",
         "Descriptions":"Pick a couple of dumbbells and stand with a straight torso and the dumbbells by your side at arms length with the palms of the hand facing you. This will be your starting position. While maintaining the torso in a stationary position (no swinging), lift the dumbbells to your side with a slight bend on the elbow and the hands slightly tilted forward as if pouring water in a glass. Continue to go up until you arms are parallel to the floor. Exhale as you execute this movement and pause for a second at the top. Lower the dumbbells back down slowly to the starting position as you inhale. Repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/3VcKaXpzqRo"
      },
      {
         "Exercise":"side wrist pull",
         "Descriptions":"This stretch works best standing. Cross your left arm over the midline of your body and hold the left wrist in your right hand down at the level of your hips. Start the stretch with a bent left arm. Slowly straighten, pull, and lift it up to shoulder height, as pictured. Feel this stretch originate in your back, not your shoulders, and don't pull too hard on the shoulders joint. Switch sides. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/G0XPmf8qW88"
      },
      {
         "Exercise":"single dumbbell raise",
         "Descriptions":"With a wide stance, hold a dumbell with both hands, grasping the head of the dumbbell instead of the handle. Your arms should be extended and hanging at the waist. This will be your starting position. Raise the weight until it is above shoulder level, keeping your arms extended. Your torso and hips should remain stationary throughout the movement. Return to the starting position and repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/-t7fuZ0KhDA&t=1s"
      },
      {
         "Exercise":"sled reverse flye",
         "Descriptions":"Attach dual handles to a sled connected by a rope or chain. Load the sled to a light weight. Face the sled, backing up until there is some tension in the line. Take both handles at arms length at about waist level. Bend the knees slightly and keep your chest and head up. This will be your starting position. Without flexing the elbow, pull the handles upward and apart, performing a reverse fly with some external rotation. Your palms should be facing forward as you do this. Return to the starting position, taking a couple steps back to take the slack out of the line.  ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/BisIi4cagtI"
      },
      {
         "Exercise":"smith machine one-arm upright row",
         "Descriptions":"With the bar at thigh level, load an appropriate weight. Take a wide grip on the bar and unhook the weight, removing your off hand from the bar. Your arm should be extended as you stand up straight with your head and chest up. This will be your starting position. Begin the movement by flexing the elbow, raising the upper arm with the elbow pointed out. Continue until your upper arm is parallel to the floor. After a brief pause, return the weight to the starting position. Repeat for the desired number of repetitions before engaging the hooks to rack the weight. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/hXoz78Jhhwo"
      },
      {
         "Exercise":"standing bradford press",
         "Descriptions":"Place a loaded bar at shoulder level in a rack. With a pronated grip at shoulder width, begin with the bar racked across the front of your shoulders. This is your starting position. Initiate the lift by extending the elbows to press the bar overhead. Avoid locking out the elbow as you move the weight behind your head. Lower the bar down to the back of the head until your elbow forms a right angle. Lift the bar back over your head by extending the elbows Lower the bar down to the starting position. Alternate in this manner until you complete the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/7aCSp9GtQDw"
      },
      {
         "Exercise":"standing military press",
         "Descriptions":"Start by placing a barbell that is about chest high on a squat rack. Once you have selected the weights, grab the barbell using a pronated (palms facing forward) grip. Make sure to grip the bar wider than shoulder width apart from each other. Slightly bend the knees and place the barbell on your collar bone. Lift the barbell up keeping it lying on your chest. Take a step back and position your feet shoulder width apart from each other. Once you pick up the barbell with the correct grip length, lift the bar up over your head by locking your arms. Hold at about shoulder level and slightly in front of your head. This is your starting position. Lower the bar down to the collarbone slowly as you inhale. Lift the bar back up to the starting position as you exhale. Repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/2yjwXTZQDDI"
      },
      {
         "Exercise":"standing palm-in one-arm dumbbell press",
         "Descriptions":"Start by having a dumbbell in one hand with your arm fully extended to the side using a neutral grip. Use your other arm to hold on to an incline bench to keep your balance. Your feet should be shoulder width apart from each other. Now slowly lift the dumbbell up until you create a 90 degree angle with your arm. Note: Your forearm should be perpendicular to the floor. Continue to maintain a neutral grip throughout the entire exercise. Slowly lift the dumbbell up until your arm is fully extended. This the starting position. While inhaling lower the weight down until your arm is at a 90 degree angle again. Feel the contraction for a second and then lift the weight back up towards the starting position while exhaling. Remember to hold on to the incline bench and keep your feet positioned to keep balance during the exercise. Repeat for the recommended amount of repetitions. Switch arms and repeat the exercise. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/oeibMQsA_G8"
      },
      {
         "Exercise":"standing two-arm overhead throw",
         "Descriptions":"Stand with your feet shoulder width apart holding a medicine ball in both hands. To begin, reach the medicine ball deep behind your head as you bend the knees slightly and lean back. Violently throw the ball forward, flexing at the hip and using your whole body to complete the movement. The medicine ball can be thrown to a partner or to a wall, receiving it as it bounces back. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"two-arm kettlebell jerk",
         "Descriptions":" Clean two kettlebells to your shoulders. Clean the kettlebells to your shoulders by extending through the legs and hips as you swing the kettlebells towards your shoulders. Rotate your wrists as you do so, so that the palms face forward. Squat down a few inches and reverse the motion rapidly driving both kettlebells overhead. Immediately after the initial push, squat down again and get under the kettlebells. Once the kettlebells are locked out, stand upright to complete the exercise. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/SutFe2ijymU"
      },
      {
         "Exercise":"upright barbell row",
         "Descriptions":"Grasp a barbell with an overhand grip that is slightly less than shoulder width. The bar should be resting on the top of your thighs with your arms extended and a slight bend in your elbows. Your back should also be straight. This will be your starting position. Now exhale and use the sides of your shoulders to lift the bar, raising your elbows up and to the side. Keep the bar close to your body as you raise it. Continue to lift the bar until it nearly touches your chin. Tip: Your elbows should drive the motion, and should always be higher than your forearms. Remember to keep your torso stationary and pause for a second at the top of the movement. Lower the bar back down slowly to the starting position. Inhale as you perform this portion of the movement. Repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/amCU-ziHITM"
      },
      {
         "Exercise":"board press",
         "Descriptions":"Begin by lying on the bench, getting your head beyond the bar if possible. One to five boards, made out of 2x6's, can be screwed together and held in place by a training partner, bands, or just tucked under your shirt. Tuck your feet underneath you and arch your back. Using the bar to help support your weight, lift your shoulder off the bench and retract them, squeezing the shoulder blades together. Use your feet to drive your traps into the bench. Maintain this tight body position throughout the movement. You can take a standard bench grip, or shoulder width to focus on the triceps. Pull the bar out of the rack without protracting your shoulders. The bar, wrist, and elbow should stay in line at all times. Focus on squeezing the bar and trying to pull it apart. Lower the bar to the boards, and then drive the bar up with as much force as possible. The elbows should be tucked in until lockout. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/XeScw6pghNw"
      },
      {
         "Exercise":"body-up",
         "Descriptions":"Assume a plank position on the ground. You should be supporting your body weight on your toes and forearms keeping your torso straight. Your forearms should be shoulder-width apart. This will be your starting position. Pressing your palms firmly into the ground, extend through the elbows to raise your body from the ground. Keep your torso rigid as you perform the movement. Slowly lower your forearms back to the ground by allowing the elbows to flex. Repeat for the desired number of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/sa1k_vNTPWo"
      },
      {
         "Exercise":"cable one arm tricep extension",
         "Descriptions":" With your right hand, grasp a single handle attached to the high-cable pulley using a supinated (underhand; palms facing up) grip. You should be standing directly in front of the weight stack. Now pull the handle down so that your upper arm and elbow are locked in to the side of your body. Your upper arm and forearm should form an acute angle (less than 90-degrees). You can keep the other arm by the waist and you can have one leg in front of you and the other one back for better balance. This will be your starting position. As you contract the triceps, move the single handle attachment down to your side until your arm is straight. Breathe out as you perform this movement. Tip: Only the forearms should move. Your upper arms should remain stationary at all times. Squeeze the triceps and hold for a second in this contracted position. Slowly return the handle to the starting position. Repeat for the recommended amount of repetitions and then perform the same movement with the other arm.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/YfDxCvoadsM"
      },
      {
         "Exercise":"cable rope overhead triceps extension",
         "Descriptions":"Attach a rope to the bottom pulley of the pulley machine. Grasping the rope with both hands, extend your arms with your hands directly above your head using a neutral grip (palms facing each other). Your elbows should be in close to your head and the arms should be perpendicular to the floor with the knuckles aimed at the ceiling. This will be your starting position. Slowly lower the rope behind your head as you hold the upper arms stationary. Inhale as you perform this movement and pause when your triceps are fully stretched. Return to the starting position by flexing your triceps as you breathe out. Repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/mRozZKkGIfg"
      },
      {
         "Exercise":"chain handle extension",
         "Descriptions":" You will need two cable handle attachments and a flat bench, as well as chains, for this exercise. Clip the middle of the chains to the handles, and position yourself on the flat bench. Your elbows should be pointing straight up. Begin by extending through the elbow, keeping your upper arm still, with your wrists pronated. Pause at the lockout, and reverse the motion to return to the starting position.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/Ta12euVr2-o"
      },
      {
         "Exercise":"close-grip barbell bench press",
         "Descriptions":"Lie back on a flat bench. Using a close grip (around shoulder width), lift the bar from the rack and hold it straight over you with your arms locked. This will be your starting position. As you breathe in, come down slowly until you feel the bar on your middle chest. Tip: Make sure that - as opposed to a regular bench press - you keep the elbows close to the torso at all times in order to maximize triceps involvement. After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your triceps muscles. Lock your arms in the contracted position, hold for a second and then start coming down slowly again. Tip: It should take at least twice as long to go down than to come up. Repeat the movement for the prescribed amount of repetitions. When you are done, place the bar back in the rack. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/nEF0bv2FW94"
      },
      {
         "Exercise":"close-grip ez-bar press",
         "Descriptions":"Lie on a flat bench with an EZ bar loaded to an appropriate weight. Using a narrow grip lift the bar and hold it straight over your torso with your elbows in. The arms should be perpendicular to the floor. This will be your starting position. Now lower the bar down to your lower chest as you breathe in. Keep the elbows in as you perform this movement. Using the triceps to push the bar back up, press it back to the starting position by extending the elbows as you exhale. Repeat. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/RwcikY07r74"
      },
      {
         "Exercise":"close-grip push-up off of a dumbbell",
         "Descriptions":"Lie on the floor and place your hands on an upright dumbbell. Supporting your weight on your toes and hands, keep your torso rigid and your elbows in with your arms straight. This will be your starting position. Lower your body, allowing the elbows to flex while you inhale. Keep your body straight, not allowing your hips to rise or sag. Press yourself back up to the starting position by extending the elbows. Breathe out as you perform this step. After a pause at the contracted position, repeat the movement for the prescribed amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/TShBPBXbRgM"
      },
      {
         "Exercise":"decline close-grip bench to skull crusher",
         "Descriptions":"Secure your legs at the end of the decline bench and slowly lay down on the bench. Using a close grip (a grip that is slightly less than shoulder width), lift the bar from the rack and hold it straight over you with your arms locked and elbows in. The arms should be perpendicular to the floor. This will be your starting position. Tip: In order to protect your rotator cuff, it is best if you have a spotter help you lift the barbell off the rack. Now lower the bar down to your lower chest as you breathe in. Keep the elbows in as you perform this movement. Using the triceps to push the bar back up, press it back to the starting position as you exhale. As you breathe in and you keep the upper arms stationary, bring the bar down slowly by moving your forearms in a semicircular motion towards you until you feel the bar slightly touch your forehead. Breathe in as you perform this portion of the movement. Lift the bar back to the starting position by contracting the triceps and exhaling. Repeat steps 3-6 until the recommended amount of repetitions is performed. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/sLae_WpobiM"
      },
      {
         "Exercise":"decline dumbbell triceps extension",
         "Descriptions":"Secure your legs at the end of the decline bench and lie down with a dumbbell on each hand on top of your thighs. The palms of your hand will be facing each other. Once you are laying down, move the dumbbells in front of you at shoulder width. The palms of the hands should be facing each other and the arms should be perpendicular to the floor and fully extended. This will be your starting position. As you breathe in and you keep the upper arms stationary (and elbows in), bring the dumbbells down slowly by moving your forearms in a semicircular motion towards you until your thumbs are next to your ears. Breathe in as you perform this portion of the movement. Lift the dumbbells back to the starting position by contracting the triceps and exhaling. Repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/vLJX0UK07y4"
      },
      {
         "Exercise":"dip machine",
         "Descriptions":" Sit securely in a dip machine, select the weight and firmly grasp the handles. Now keep your elbows in at your sides in order to place emphasis on the triceps. The elbows should be bent at a 90 degree angle. As you contract the triceps, extend your arms downwards as you exhale. Tip: At the bottom of the movement, focus on keeping a little bend in your arms to keep tension on the triceps muscle. Now slowly let your arms come back up to the starting position as you inhale. Repeat for the recommended amount of repetitions.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/DxclRo0Rf1I"
      },
      {
         "Exercise":"dips - triceps version",
         "Descriptions":"To get into the starting position, hold your body at arm's length with your arms nearly locked above the bars. Now, inhale and slowly lower yourself downward. Your torso should remain upright and your elbows should stay close to your body. This helps to better focus on tricep involvement. Lower yourself until there is a 90 degree angle formed between the upper arm and forearm. Then, exhale and push your torso back up using your triceps to bring your body back to the starting position. Repeat the movement for the prescribed amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/sM6XUdt1rm4"
      },
      {
         "Exercise":"dumbbell floor press",
         "Descriptions":"Lay on the floor holding dumbbells in your hands. Your knees can be bent. Begin with the weights fully extended above you. Lower the weights until your upper arm comes in contact with the floor. You can tuck your elbows to emphasize triceps size and strength, or to focus on your chest angle your arms to the side. Pause at the bottom, and then bring the weight together at the top by extending through the elbows. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/uUGDRwge4F8"
      },
      {
         "Exercise":"dumbbell one-arm triceps extension",
         "Descriptions":"Grab a dumbbell and either sit on a military press bench or a utility bench that has a back support on it as you place the dumbbells upright on top of your thighs or stand up straight. Clean the dumbbell up to bring it to shoulder height and then extend the arm over your head so that the whole arm is perpendicular to the floor and next to your head. The dumbbell should be on top of you. The other hand can be kept fully extended to the side, by the waist, supporting the upper arm that has the dumbbell or grabbing a fixed surface. Rotate the wrist so that the palm of your hand is facing forward and the pinkie is facing the ceiling. This will be your starting position. Slowly lower the dumbbell behind your head as you hold the upper arm stationary. Inhale as you perform this movement and pause when your triceps are fully stretched. Return to the starting position by flexing your triceps as you breathe out. Tip: It is imperative that only the forearm moves. The upper arm should remain at all times stationary next to your head. Repeat for the recommended amount of repetitions and switch arms. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/_gsUck-7M74"
      },
      {
         "Exercise":"ez-bar skullcrusher",
         "Descriptions":"Using a close grip, lift the EZ bar and hold it with your elbows in as you lie on the bench. Your arms should be perpendicular to the floor. This will be your starting position. Keeping the upper arms stationary, lower the bar by allowing the elbows to flex. Inhale as you perform this portion of the movement. Pause once the bar is directly above the forehead. Lift the bar back to the starting position by extending the elbow and exhaling. Repeat. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/d_KZxkY_0cM"
      },
      {
         "Exercise":"floor press",
         "Descriptions":"Adjust the j-hooks so they are at the appropriate height to rack the bar. Begin lying on the floor with your head near the end of a power rack. Keeping your shoulder blades pulled together; pull the bar off of the hooks. Lower the bar towards the bottom of your chest or upper stomach, squeezing the bar and attempting to pull it apart as you do so. Ensure that you tuck your elbows throughout the movement. Lower the bar until your upper arm contacts the ground and pause, preventing any slamming or bouncing of the weight. Press the bar back up as fast as you can, keeping the bar, your wrists, and elbows in line as you do so. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/vZsZzu0TaS8"
      },
      {
         "Exercise":"kneeling cable triceps extension",
         "Descriptions":"Place a bench sideways in front of a high pulley machine. Hold a straight bar attachment above your head with your hands about 6 inches apart with your palms facing down. Face away from the machine and kneel. Place your head and the back of your upper arms on the bench. Your elbows should be bent with the forearms pointing towards the high pulley. This will be your starting position. While keeping your upper arms close to your head at all times with the elbows in, press the bar out in a semicircular motion until the elbows are locked and your arms are parallel to the floor. Contract the triceps hard and keep this position for a second. Exhale as you perform this movement. Slowly return to the starting position as you breathe in. Repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/mBZ4vnJRHgU"
      },
      {
         "Exercise":"lying close-grip barbell triceps press to chin",
         "Descriptions":" While holding a barbell or EZ Curl bar with a pronated grip (palms facing forward), lie on your back on a flat bench with your head off the end of the bench. Tip: If you are holding a barbell grab it using a shoulder-width grip and if you are using an E-Z Bar grab it on the inner handles. Extend your arms in front of you as you hold the barbell over your chest. The arms should be perpendicular to your torso (90-degree angle). This will be your starting position. As you inhale, lower the bar in a semi-circular motion by bending at the elbows and while keeping the upper arm stationary and elbows in. Keep lowering the bar until it lightly touches your chin. As you exhale bring the bar back up to the starting position by pushing the bar up in a semi-circular motion. Contract the triceps hard at the top of the movement for a second. Tip: Again, only the forearms should move. The upper arms should remain stationary at all times. Repeat for the recommended amount of repetitions.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/hzmlg0KzN8I"
      },
      {
         "Exercise":"lying dumbbell tricep extension",
         "Descriptions":"Lie on a flat bench while holding two dumbbells directly in front of you. Your arms should be fully extended at a 90-degree angle from your torso and the floor. The palms should be facing in and the elbows should be tucked in. This is the starting position. As you breathe in and you keep the upper arms stationary with the elbows in, slowly lower the weight until the dumbbells are near your ears. At that point, while keeping the elbows in and the upper arms stationary, use the triceps to bring the weight back up to the starting position as you breathe out. Repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/HsBWFgwPM9U"
      },
      {
         "Exercise":"machine triceps extension",
         "Descriptions":"Adjust the seat to the appropriate height and make your weight selection. Place your upper arms against the pads and grasp the handles. This will be your starting position. Perform the movement by extending the elbow, pulling your lower arm away from your upper arm. Pause at the completion of the movement, and then slowly return the weight to the starting position. Avoid returning the weight all the way to the stops until the set is complete to keep tension on the muscles being worked. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/v9xqdzPN4z8"
      },
      {
         "Exercise":"one arm supinated dumbbell triceps extension",
         "Descriptions":"Lie flat on a bench while holding a dumbbell at arms length. Your arm should be perpendicular to your body. The palm of your hand should be facing towards your face as a supinated grip is required to perform this exercise. Place your non lifting hand on your bicep for support. Slowly begin to lower the dumbbell down as you breathe in. Then, begin lifting the dumbbell upward as you contract the triceps. Remember to breathe out during the concentric (lifting part of the exercise). Repeat until you have performed your set repetitions. Switch arms and repeat the movement. Switch arms again and repeat the movement. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/BbWEM7tURj4"
      },
      {
         "Exercise":"pin presses",
         "Descriptions":"Pin presses remove the eccentric phase of the bench press, developing starting strength. They also allow you to train a desired range of motion. The bench should be set up in a power rack. Set the pins to the desired point in your range of motion, whether it just be lockout or an inch off of your chest. The bar should be moved to the pins and prepared for lifting. Begin by lying on the bench, with the bar directly above the contact point during your regular bench. Tuck your feet underneath you and arch your back. Using the bar to help support your weight, lift your shoulder off the bench and retract them, squeezing the shoulder blades together. Use your feet to drive your traps into the bench. Maintain this tight body position throughout the movement. You can take a standard bench grip, or shoulder width to focus on the triceps. The bar, wrist, and elbow should stay in line at all times. Focus on squeezing the bar and trying to pull it apart. Drive the bar up with as much force as possible. The elbows should be tucked in until lockout. Return the bar to the pins, pausing before beginning the next repetition. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/h1hQvDLFYt8"
      },
      {
         "Exercise":"reverse band bench press",
         "Descriptions":"Position a bench inside a power rack, with the bar set to the correct height. Begin by anchoring bands either to band pegs or to the top of the rack. Ensure that you will be position properly under the bands. Attach the other end to the barbell. Lie on the bench, tuck your feet underneath you and arch your back. Using the bar to help support your weight, lift your shoulder off the bench and retract them, squeezing the shoulder blades together. Use your feet to drive your traps into the bench. Maintain this tight body position throughout the movement. However wide your grip, it should cover the ring on the bar. Pull the bar out of the rack without protracting your shoulders. Focus on squeezing the bar and trying to pull it apart. Lower the bar to your lower chest or upper stomach. The bar, wrist, and elbow should stay in line at all times. Pause when the barbell touches your torso, and then drive the bar up with as much force as possible. The elbows should be tucked in until lockout. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/1GBj56asFN8"
      },
      {
         "Exercise":"reverse grip triceps pushdown",
         "Descriptions":" Start by setting a bar attachment (straight or e-z) on a high pulley machine. Facing the bar attachment, grab it with the palms facing up (supinated grip) at shoulder width. Lower the bar by using your lats until your arms are fully extended by your sides. Tip: Elbows should be in by your sides and your feet should be shoulder width apart from each other. This is the starting position. Slowly elevate the bar attachment up as you inhale so it is aligned with your chest. Only the forearms should move and the elbows/upper arms should be stationary by your side at all times. Then begin to lower the cable bar back down to the original staring position while exhaling and contracting the triceps hard. Repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/Q1_WXKQV8aE"
      },
      {
         "Exercise":"reverse triceps bench press",
         "Descriptions":"Lie back on a flat bench. Using a close, supinated grip (around shoulder width), lift the bar from the rack and hold it straight over you with your arms locked extended in front of you and perpendicular to the floor. This will be your starting position. As you breathe in, come down slowly until you feel the bar on your middle chest. Tip: Make sure that as opposed to a regular bench press, you keep the elbows close to the torso at all times in order to maximize triceps involvement. After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your triceps muscles. Lock your arms in the contracted position, hold for a second and then start coming down slowly again. Tip: It should take at least twice as long to go down than to come up. Repeat the movement for the prescribed amount of repetitions. When you are done, place the bar back in the rack. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/HGaYGsdTp4g"
      },
      {
         "Exercise":"ring dips",
         "Descriptions":"Grip a ring in each hand, and then take a small jump to help you get into the starting position with your arms locked out. Begin by flexing the elbow, lowering your body until your arms break 90 degrees. Avoid swinging, and maintain good posture throughout the descent. Reverse the motion by extending the elbow, pushing yourself back up into the starting position. Repeat for the desired number of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/jCtSXZk9nko"
      },
      {
         "Exercise":"seated bent-over one-arm dumbbell triceps extension",
         "Descriptions":"Sit down at the end of a flat bench with a dumbbell in one arm using a neutral grip (palms of the hand facing you). Bend your knees slightly and bring your torso forward, by bending at the waist, while keeping the back straight until it is almost parallel to the floor. Make sure that you keep the head up. The upper arm with the dumbbell should be close to the torso and aligned with it (lifted up until it is parallel to the floor while the forearms are pointing towards the floor as the hands hold the weights). Tip: There should be a 90-degree angle between the forearms and the upper arm. This is your starting position. Keeping the upper arm stationary, use the triceps to lift the weight as you exhale until the forearm is parallel to the floor and the whole arm is extended. Like many other arm exercises, only the forearm moves. After a second contraction at the top, slowly lower the dumbbell back to the starting position as you inhale. Repeat the movement for the prescribed amount of repetitions. Switch arms and repeat the exercise. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/h49b5zgWsAk"
      },
      {
         "Exercise":"seated bent-over two-arm dumbbell triceps extension",
         "Descriptions":"Sit down at the end of a flat bench with a dumbbell in both arms using a neutral grip (palms of the hand facing you). Bend your knees slightly and bring your torso forward, by bending at the waist, while keeping the back straight until it is almost parallel to the floor. Make sure that you keep the head up. The upper arms with the dumbbells should be close to the torso and aligned with it (lifted up until they are parallel to the floor while the forearms are pointing towards the floor as the hands hold the weights). Tip: There should be a 90-degree angle between the forearms and the upper arm. This is your starting position. Keeping the upper arms stationary, use the triceps to lift the weight as you exhale until the forearms are parallel to the floor and the whole arm is extended. Like many other arm exercises, only the forearm moves. After a second contraction at the top, slowly lower the dumbbells back to the starting position as you inhale. Repeat the movement for the prescribed amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/VudwEqVgL0I"
      },
      {
         "Exercise":"sled overhead triceps extension",
         "Descriptions":"Attach dual handles to a sled using a chain or rope. Load the sled to an appropriate load. Facing away from the sled, step away until there is tension in the line. Raise your hands above your head, keeping them together, palms facing each other. Your elbows should be pointed upward with the elbows flexed. This will be your starting position. Extend through the elbow to straighten the arm. Ensure that your upper arm stays in position to isolate the triceps. Upon full extension, step forward to take the slack out of the line. You may keep your feet staggered for more stability. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/fuySBdoPzzQ"
      },
      {
         "Exercise":"smith machine close-grip bench press",
         "Descriptions":"Place a flat bench underneath the smith machine. Place the barbell at a height that you can reach when lying down and your arms are almost fully extended. Once the weight you need is selected, lie down on the flat bench. Using a close and pronated grip (palms facing forward) that is around shoulder width, unlock the bar from the rack and hold it straight over you with your arms locked. This will be your starting position. As you breathe in, come down slowly until you feel the bar on your middle chest. Tip: Make sure that as opposed to a regular bench press, you keep the elbows close to the torso at all times in order to maximize triceps involvement. After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your triceps muscles. Lock your arms in the contracted position, hold for a second and then start coming down slowly again. Tip: It should take at least twice as long to go down than to come up. Repeat the movement for the prescribed amount of repetitions. When you are done, lock the bar back in the rack. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/63OZMK_nTQI"
      },
      {
         "Exercise":"speed band pushdown",
         "Descriptions":"Choke a band onto a pull up bar. Grasp the band with a pronated grip, hands close together. Beginning with the elbow flexed, extend the elbow to straighten your arms, ensuring you keep your upper arm in place. Pause briefly, and return to the starting position. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/GCT3oiq5h7k"
      },
      {
         "Exercise":"standing bent-over one-arm dumbbell triceps extension",
         "Descriptions":"With a dumbbell in one hand and the palm facing your torso, bend your knees slightly and bring your torso forward, by bending at the waist, while keeping the back straight until it is almost parallel to the floor. Make sure that you keep the head up. The upper arm should be close to the torso and parallel to the floor while the forearm is pointing towards the floor as the hand holds the weight. Tip: There should be a 90-degree angle between the forearm and the upper arm. This is your starting position. Keeping the upper arms stationary, use the triceps to lift the weights as you exhale until the forearms are parallel to the floor and the whole arm is extended. Like many other arm exercises, only the forearm moves. After a second contraction at the top, slowly lower the dumbbell back to the starting position as you inhale. Repeat the movement for the prescribed amount of repetitions. Switch arms and repeat the exercise. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/SsUzUGSqQwk"
      },
      {
         "Exercise":"standing dumbbell triceps extension",
         "Descriptions":"To begin, stand up with a dumbbell held by both hands. Your feet should be about shoulder width apart from each other. Slowly use both hands to grab the dumbbell and lift it over your head until both arms are fully extended. The resistance should be resting in the palms of your hands with your thumbs around it. The palm of the hands should be facing up towards the ceiling. This will be your starting position. Keeping your upper arms close to your head with elbows in and perpendicular to the floor, lower the resistance in a semicircular motion behind your head until your forearms touch your biceps. Tip: The upper arms should remain stationary and only the forearms should move. Breathe in as you perform this step. Go back to the starting position by using the triceps to raise the dumbbell. Breathe out as you perform this step. Repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/-Vyt2QdsR7E"
      },
      {
         "Exercise":"standing one-arm dumbbell triceps extension",
         "Descriptions":"To begin, stand up with a dumbbell held in one hand. Your feet should be about shoulder width apart from each other. Now fully extend the arm with the dumbbell over your head. Tip: The small finger of your hand should be facing the ceiling and the palm of your hand should be facing forward. The dumbbell should be above your head. This will be your starting position. Keeping your upper arm close to your head (elbows in) and perpendicular to the floor, lower the resistance in a semicircular motion behind your head until your forearm touch your bicep. Tip: The upper arm should remain stationary and only the forearm should move. Breathe in as you perform this step. Go back to the starting position by using the triceps to raise the dumbbell. Breathe out as you perform this step. Repeat for the recommended amount of repetitions. Switch arms and repeat the exercise. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/_gsUck-7M74&t=9s"
      },
      {
         "Exercise":"tricep dumbbell kickback",
         "Descriptions":"Start with a dumbbell in each hand and your palms facing your torso. Keep your back straight with a slight bend in the knees and bend forward at the waist. Your torso should be almost parallel to the floor. Make sure to keep your head up. Your upper arms should be close to your torso and parallel to the floor. Your forearms should be pointed towards the floor as you hold the weights. There should be a 90-degree angle formed between your forearm and upper arm. This is your starting position. Now, while keeping your upper arms stationary, exhale and use your triceps to lift the weights until the arm is fully extended. Focus on moving the forearm. After a brief pause at the top contraction, inhale and slowly lower the dumbbells back down to the starting position. Repeat the movement for the prescribed amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/6SS6K3lAwZ8"
      },
      {
         "Exercise":"triceps overhead extension with rope",
         "Descriptions":"Attach a rope to a low pulley. After selecting an appropriate weight, grasp the rope with both hands and face away from the cable. Position your hands behind your head with your elbows point straight up. Your elbows should start out flexed, and you can stagger your stance and lean gently away from the machine to create greater stability. This will be your starting position. To perform the movement, extend through the elbow while keeping the upper arm in position, raising your hands above your head. Squeeze your triceps at the top of the movement, and slowly lower the weight back to the start position. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/j6dkrZYLM4c"
      },
      {
         "Exercise":"triceps pushdown - rope attachment",
         "Descriptions":"Attach a rope attachment to a high pulley and grab with a neutral grip (palms facing each other). Standing upright with the torso straight and a very small inclination forward, bring the upper arms close to your body and perpendicular to the floor. The forearms should be pointing up towards the pulley as they hold the rope with the palms facing each other. This is your starting position. Using the triceps, bring the rope down as you bring each side of the rope to the side of your thighs. At the end of the movement the arms are fully extended and perpendicular to the floor. The upper arms should always remain stationary next to your torso and only the forearms should move. Exhale as you perform this movement. After holding for a second, at the contracted position, bring the rope slowly up to the starting point. Breathe in as you perform this step. Repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/vB5OHsJ3EME"
      },
      {
         "Exercise":"triceps stretch",
         "Descriptions":"Reach your hand behind your head, grasp your elbow and gently pull. Hold for 10 to 20 seconds, then switch sides. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/yAvpW_zKJmI"
      },
      {
         "Exercise":"weighted bench dip",
         "Descriptions":"For this exercise you will need to place a bench behind your back and another one in front of you. With the benches perpendicular to your body, hold on to one bench on its edge with the hands close to your body, separated at shoulder width. Your arms should be fully extended. The legs will be extended forward on top of the other bench. Your legs should be parallel to the floor while your torso is to be perpendicular to the floor. Have your partner place the dumbbell on your lap. Note: This exercise is best performed with a partner as placing the weight on your lap can be challenging and cause injury without assistance. This will be your starting position. Slowly lower your body as you inhale by bending at the elbows until you lower yourself far enough to where there is an angle slightly smaller than 90 degrees between the upper arm and the forearm. Tip: Keep the elbows as close as possible throughout the movement. Forearms should always be pointing down. Using your triceps to bring your torso up again, lift yourself back to the starting position while exhaling. Repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/GZlnqG4CqLc"
      }
       
    ]
    
}