{
   "back":[
      {
         "Exercise":"atlas stone trainer",
         "Descriptions":"Begin by loading the desired weight onto the bar. Straddle the weight, wrapping your arms around the implement, bending at the hips. Begin by pulling the weight up past the knees, extending through the hips. As the weight clears the knees, it can be lapped by resting it on your thighs and sitting back, hugging it tightly to your chest. Finish the movement by extending through your hips and knees to raise the weight as high as possible. The weight can be returned to the lap or to the ground for successive repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/2y5CD3fSmAo"
      },
      {
         "Exercise":"axle deadlift",
         "Descriptions":"Approach the bar so that it is centered over your feet. You feet should be about hip width apart. Bend at the hip to grip the bar at shoulder width, allowing your shoulder blades to protract. Typically, you would use an over/under grip. With your feet and your grip set, take a big breath and then lower your hips and flex the knees until your shins contact the bar. Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward. After the bar passes the knees, aggressively pull the bar back, pulling your shoulder blades together as you drive your hips forward into the bar. Lower the bar by bending at the hips and guiding it to the floor.  ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/DA1IwrELPUc"
      },
      {
         "Exercise":"cat stretch",
         "Descriptions":"Position yourself on the floor on your hands and knees. Pull your belly in and round your spine, lower back, shoulders, and neck, letting your head drop. Hold for 15 seconds. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/ZiNXOE5EsZw"
      },
      {
         "Exercise":"child's pose",
         "Descriptions":"On your knees, with arms straight out put your hands on the ground and slowly push your butt backwards to stretch.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/V22xxybieHk"
      },
      {
         "Exercise":"crossover reverse lunge",
         "Descriptions":"Squat down and put one foot behind the heel of the other foot. Flex your hips and your front knee. Pause for a brief second and return to starting position.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/_X_NgMn1gY8"
      },
      {
         "Exercise":"dancer's stretch",
         "Descriptions":"Sit on the floor cross one of your legs over the other leg. With your knee bent, keep your other leg straight and rotate your body to the crossed leg. Hold the position for a few seconds and repeat with the other side.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/A16zIcbR5sU"
      },
      {
         "Exercise":"deadlift with chains",
         "Descriptions":"Load up a barbell for a deadlift and add chains to the bar. With knees bent and chest up, grasp the bars and stand up while keeping your upper and lowerback straight.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/RS6R7pAD6Ao"
      },
      {
         "Exercise":"deficit deadlift",
         "Descriptions":"Stand on an elevated platform and With knees bent and chest up, grasp the bars and stand up while keeping your upper and lowerback straight.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/ppPHPO7aX7o"
      },
     {
         "Exercise":"hug knees to chest",
         "Descriptions":"Lay flat on your back. With both your legs together put your hands on your knees and pull them back, Hold for a few seconds.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/aGSVAhadpFY"
      },
       {
         "Exercise":"hyperextensions (back extensions)",
         "Descriptions":"Stand on an elevated platform. Lean forward to stretch your back, next tighten your back and return to starting position.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/vx0jZBEmZcE"
      },
      {
         "Exercise":"lower back-smr",
         "Descriptions":"Using a foam roller, lay on your side. With a foam roller underneath your back. Foam roll the desired position.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/i1gDOlTljYo"
      },
      {
         "Exercise":"pelvic tilt into bridge",
         "Descriptions":"Lie down on your back with heels directly under your knees. Lift your tailbone up with your upper back still on the ground. Next lift the entire spine except the neck.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/oje869YCAL4"
      },
      {
         "Exercise":"pyramid",
         "Descriptions":"Roll your torso on the top of the ball. Rest your hands and feet on the floor.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/-uHtpZRPHto"
      },
      {
         "Exercise":"rack pulls",
         "Descriptions":"Set up a power rack with pins below the knee. Have a barbell loaded with weights on the pins. With neutral spine extend through your legs and hips and pull the weight up.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/aAjN8zS7Idg"
      },
      {
         "Exercise":"reverse band deadlift",
         "Descriptions":"In a power rack put safety bars high above you and have your bands go through the safety bars. Also put your barbell through the bands. With knees bent chest up and a straight back. Drive through your hips and breathe out. Finish the motion by standing up straight.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/fOCXklRYw9w"
      },
      {
         "Exercise":"seated good mornings",
         "Descriptions":"Sit down on a chair. Have a loaded barbell on your back. Lean forward until you feel a stretch in your lower back. Pause for desired seconds, return to starting position.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/S7WGAvaGxOw"
      },
      {
         "Exercise":"stiff leg barbell good morning",
         "Descriptions":"Stand up straight with feet shoulder width apart. Have a loaded barbell on your back. With unbent knees lower your torso and feel the stretch in your lower back. Pause for desired seconds and return to starting position.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/xUZRtvrJgSg"
      },
      {
         "Exercise":"superman",
         "Descriptions":"Lay on a flat mat belly side down. Have your arms directly in front of you and your legs together. Raise your arms and your legs and pause for desired seconds. Return to starting position and repeat.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/cc6UVRS7PW4"
      },
      {
         "Exercise":"weighted ball hyperextension",
         "Descriptions":"Lay belly side down on a medicine ball. Lift your torso until you feel a stretch in your lower back. Hold the position and slow return to starting position. Repeat if necessary.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/Vv58Ttd1SOI"
      },
      {
         "Exercise":"alternating renegade row",
         "Descriptions":"Have a barbell on the ground and hold onto it with one hand. Lean back and grab the other dumbell and bring it to your side. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/wBOyCwHw00E"
      },
      {
         "Exercise":"bent over one-arm long bar row",
         "Descriptions":"With one arm hold onto the loaded barbell. With knees bent and your back straight. Bring the loaded barbell towards your chest.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/SbrfQvIVWrw"
      },
      {
         "Exercise":"bodyweight mid row",
         "Descriptions":"Assume the pull up position. Pull yourself up and bring your legs towards you stomach. Lay down horizontally while holding the handles. Pull yourself up.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/mlJn0B_opjU"
      },
      {
         "Exercise":"dumbbell incline row",
         "Descriptions":"Using an incline bench. Sit facing the chair. Hold dumbells and perform a row by bringing the weight towards your side.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/x6nEPnQ37FQ"
      },
      {
         "Exercise":"inverted row with straps",
         "Descriptions":"Hold onto the straps and lower your hold body as far as you can go. Pull yourself back up towards the straps.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/prw1ACiWgsg"
      },
      {
         "Exercise":"lying t-bar row",
         "Descriptions":"Stand on an elevated platform with torso support. Pull the t bar towards your body.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/w0KnlQ-b7jw"
      },
      {
         "Exercise":"middle back shrug",
         "Descriptions":"Using an incline bench. Sit on the bench facing the seat. With two dumbells by your side. Perform a shrug by bringing the dumbells as high as you can by bringing your shoulders up.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/iIbqTPIQyLk"
      },
      {
         "Exercise":"mixed grip chin up",
         "Descriptions":"Perform a chin up with one hand facing you and one hand facing away from you. pull yourself up.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/-WcLeyMhvNM"
      },
      {
         "Exercise":"one arm chin-up",
         "Descriptions":"With one arm facing you pull yourself up. As you reach to the top slowly descend back to the starting position.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/Nj1NvN7Te_s"
      },
      {
         "Exercise":"one-arm kettlebell row",
         "Descriptions":"Bend down slightly with a kettlebell by your side. Bring the kettlebell towards your chest.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/j2OdaGOmHlM"
      },
      {
         "Exercise":"seated cable rows",
         "Descriptions":"Grasp the handles and with your lower back tightened and your elbows to your side pull the handles towards your stomach.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/GZbfZ033f74"
      },
      {
         "Exercise":"seated one-arm cable pulley rows",
         "Descriptions":"Sit on a bench with one arm pull the handle towards your side and pause for desired amount of seconds and slowly return to starting position.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/NwyhyKyFgf4"
      },
      {
         "Exercise":"smith machine bent over row",
         "Descriptions":"Using a smith machine bend your knees and have your shoulder blades pushed back. Bring the barbell towards your stomach and pause at the top.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/7PhvyukQ4Sw"
      },
      {
         "Exercise":"spinal stretch",
         "Descriptions":"With hands behind the back of your head. Twist your abs towards one of your knee and have your elbow touch your knee. Repeat with the other knee.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/iVpqS8OM2Sw"
      },
      {
         "Exercise":"straight bar bench mid rows",
         "Descriptions":"Using an elevated platform. Perform a row by bringing a loaded barbell towards your stomach.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/pi_FWJSN28A"
      },
      {
         "Exercise":"t-bar row with handle",
         "Descriptions":"Holding onto a T bar handle perform a row by bringing the loaded barbell towards your stomach.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/j3Igk5nyZE4"
      },
      {
         "Exercise":"two-arm kettlebell row",
         "Descriptions":"With knees bent, bring the kettlebell towards your stomach.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/6_P3lJqTBbM"
      },
      {
         "Exercise":"upper back stretch",
         "Descriptions":"Clasp fingers together with your thumbs pointing down, round your shoulders as you reach your hands forward.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/fBpYx1XsMqg"
      }
   ]
	
}