{
  "chest":[
      {
         "Exercise":"alternating floor press",
         "Descriptions":"Lie on the floor with either two dumbbells or two kettlebells on your hand. Press one arm at a time, while the other hand is stationary. Lower your pressing hand until either your elbow or triceps touches the floor. Press the weight back up and repeat with the other hand.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/Qb-vUPub-RQ"
      },
      {
         "Exercise":"barbell bench press - medium grip",
         "Descriptions":"Lie flat on the bench, Lift the bar out of the rack straight above your chest with arms locked. Come down slowly until the bar touches the middle of your chest. After a brief pause push the bar straight up while breathing out.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/RsobeWfbBcY"
      },
      {
         "Exercise":"barbell guillotine bench press",
         "Descriptions":"Lie flat on the bench, Lift the bar out of the rack straight above your chest with arms locked. Come down slowly until the bar is about 1 inch from your neck. After a brief pause push the bar straight up while breathing out.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/cqJ2jm_YkaU"
      },
      {
         "Exercise":"behind head chest stretch",
         "Descriptions":"Sit down either on the floor or a bench, have your back straight and chest up. Place your hand on the back of your hand. Have someone or partner place their hands on your elbows and pull your elbows back until there's a stretch in your chest. Hold it for a few secoonds and bring your elbows in. Relax and repeat.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/Vm8xjOHijek"
      },
      {
         "Exercise":"bench press - with bands",
         "Descriptions":"Attach resistence bands on two ends of the barbell. Lie flat on the bench, Lift the bar out of the rack straight above your chest with arms locked. Come down slowly until the bar touches the middle of your chest. After a brief pause push the bar straight up while breathing out.",
         "link":"https://www.youtube.com/embed/STxqKLbuQVk"
      },
      {
         "Exercise":"bent-arm dumbbell pullover",
         "Descriptions":"Place a dumbbell standing up on a flat bench. Lie down perpendicular to the bench with only your shoulders lying on the surface and watch out for the dumbbell on the bench. hold on to the dumbbell with both palms facing toward the sky. The starting position should be arms straight with dumbbell directly on top of your chest. Keep your arms locked in the bent arm position and low the weight behind your head. Once you feel a stretch on the chest, bring the weight back to starting postion and repeat.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/8F8DIKfo_I0"
      },
      {
         "Exercise":"cable chest press",
         "Descriptions":"Set up the dual pulleys to chest height and select a weight that is challanging yet able to maintain good form. Hold onto the handles facing away from the pulley system and about a foot or two in front of it. Position the upper arms perpendicular with shoulder blades together. While kepping the body stationary, press the handles forward by extending your elbows. Once your elbows are fully extended, return back to the position before.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/FVWJglwid4I"
      },
      {
         "Exercise":"chest and front of shoulder stretch",
         "Descriptions":"Wrap a resistance band around a pull up bar. Stand with your legs together. Place one side of your hand around a resistance band. Turn your body slowly to the opposite side of whichever hand is holding onto the band. Once you feel a stretch, return back to starting position and repeat with the other hand.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/3A2-hVEcmn0"
      },
      {
         "Exercise":"chest push (single response)",
         "Descriptions":"Begin in a kneeling position holding a medicine ball with both hands tightly into the chest. Push the ball as far as possible by exploding forward and outward with the hips. Finish the movement by falling forward and catching youself with your hands.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/8uEWEYahoXg"
      },
      {
         "Exercise":"chest push with run release",
         "Descriptions":"Begin in running position with knees bent, hips back and back flat. Hold the medicine ball near your legs. While taking the first step draw the medicine ball into your chest. Explosively push the ball forward as you take the second step. immediately sprint forward as you release the ball.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/UZzTcPlsOHo"
      },
      {
         "Exercise":"cross over - with bands",
         "Descriptions":"Wrap an exercise band around a stationary post. grab the handles on the band and step forward, opposite of the post. Raise your arms to the sides, parallel to the floor, as well as perpendicular to your torso. Your palms should be facing forward. While keeping straight arms, bring them across your chest until you feel contraction on your pecs. Return to starting position slowly and repeat.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/ZY-O8MWvLsw"
      },
      {
         "Exercise":"decline dumbbell bench press",
         "Descriptions":"Secure your legs at the end of the decline bench and lie down with a dumbbell on each hand on top of your thighs. The palms of your hand will be facing each other. Once you are laying down, move the dumbbells in front of you at shoulder width. Once at shoulder width, rotate your wrists forward so that the palms of your hands are facing away from you. This will be your starting position. Bring down the weights slowly to your side as you breathe out. Keep full control of the dumbbells at all times. Tip: Throughout the motion, the forearms should always be perpendicular to the floor. As you breathe out, push the dumbbells up using your pectoral muscles. Lock your arms in the contracted position, squeeze your chest, hold for a second and then start coming down slowly. Tip: It should take at least twice as long to go down than to come up.. Repeat the movement for the prescribed amount of repetitions of your training program. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/0xRvl4Qv3ZY"
      },
      {
         "Exercise":"drop push",
         "Descriptions":"Position low boxes or other platforms 2-3 feet apart. Move to a pushup position between them, supporting yourself by placing your hands on the boxes. With good posture, drop from the platforms by pressing up and moving your hands to shoulder width, cushioning your landing by absorbing the impact through the arm. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"dumbbell bench press",
         "Descriptions":"Lie down on a flat bench with a dumbbell in each hand resting on top of your thighs. The palms of your hands will be facing each other. Then, using your thighs to help raise the dumbbells up, lift the dumbbells one at a time so that you can hold them in front of you at shoulder width. Once at shoulder width, rotate your wrists forward so that the palms of your hands are facing away from you. The dumbbells should be just to the sides of your chest, with your upper arm and forearm creating a 90 degree angle. Be sure to maintain full control of the dumbbells at all times. This will be your starting position. Then, as you breathe out, use your chest to push the dumbbells up. Lock your arms at the top of the lift and squeeze your chest, hold for a second and then begin coming down slowly. Tip: Ideally, lowering the weight should take about twice as long as raising it. Repeat the movement for the prescribed amount of repetitions of your training program. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/VmB1G1K7v94"
      },
      {
         "Exercise":"dynamic chest stretch",
         "Descriptions":" Stand with your hands together, arms extended directly in front of you. This will be your starting position. Keeping your arms straight, quickly move your arms back as far as possible and back in again, similar to an exaggerated clapping motion. Repeat 5-10 times, increasing speed as you do so.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/urICkMgMrjk"
      },
      {
         "Exercise":"forward drag with press",
         "Descriptions":"Attach a dual handled chain or rope attachment to the sled. You should be facing away from the sled, holding a handle in each hand. Begin the movement by moving forward for one step. Leaning forward, extend through the legs and hips to move, pausing with each step to extend through the elbows, pressing your hands forward. Step forward until you return to the start position prepared to press. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"front raise and pullover",
         "Descriptions":"Lie on a flat bench while holding a barbell using a palms down grip that is about 15 inches apart. Place the bar on your upper thighs, extend your arms and lock them while keeping a slight bend on the elbows. This will be your starting position. Now raise the weight using a semicircular motion and keeping your arms straight as you inhale. Continue the same movement until the bar is on the other side above your head . (Tip: the bar will travel approximately 180-degrees). At this point your arms should be parallel to the floor with the palms of your hands facing the ceiling. Now return the barbell to the starting position by reversing the motion as you exhale. Repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/RqoSoLhiAHs"
      },
      {
         "Exercise":"hammer grip incline db bench press",
         "Descriptions":"Lie back on an incline bench with a dumbbell on each hand on top of your thighs. The palms of your hand will be facing each other. By using your thighs to help you get the dumbbells up, clean the dumbbells one arm at a time so that you can hold them at shoulder width. Once at shoulder width, keep the palms of your hands with a neutral grip (palms facing each other). Keep your elbows flared out with the upper arms in line with the shoulders (perpendicular to the torso) and the elbows bent creating a 90-degree angle between the upper arm and the forearm. This will be your starting position. Now bring down the weights slowly to your side as you breathe in. Keep full control of the dumbbells at all times. As you breathe out, push the dumbbells up using your pectoral muscles. Lock your arms in the contracted position, hold for a second and then start coming down slowly. Tip: It should take at least twice as long to go down than to come up. Repeat the movement for the prescribed amount of repetitions. When you are done, place the dumbbells back in your thighs and then on the floor. This is the safest manner to dispose of the dumbbells. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/efYSEOobznM"
      },
      {
         "Exercise":"heavy bag thrust",
         "Descriptions":"Utilize a heavy bag for this exercise. Assume an upright stance next to the bag, with your feet staggered, fairly wide apart. Place your hand on the bag at about chest height. This will be your starting position. Begin by twisting at the waist, pushing the bag forward as hard as possible. Perform this move quickly, pushing the bag away from your body. Receive the bag as it swings back by reversing these steps. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"incline cable flye",
         "Descriptions":"To get yourself into the starting position, set the pulleys at the floor level (lowest level possible on the machine that is below your torso). Place an incline bench (set at 45 degrees) in between the pulleys, select a weight on each one and grab a pulley on each hand. With a handle on each hand, lie on the incline bench and bring your hands together at arms length in front of your face. This will be your starting position. With a slight bend of your elbows (in order to prevent stress at the biceps tendon), lower your arms out at both sides in a wide arc until you feel a stretch on your chest. Breathe in as you perform this portion of the movement. Tip: Keep in mind that throughout the movement, the arms should remain stationary. The movement should only occur at the shoulder joint. Return your arms back to the starting position as you squeeze your chest muscles and exhale. Hold the contracted position for a second. Tip: Make sure to use the same arc of motion used to lower the weights. Repeat the movement for the prescribed amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/GtHNC-5GtR0"
      },
      {
         "Exercise":"incline dumbbell flyes - with a twist",
         "Descriptions":"Hold a dumbbell in each hand and lie on an incline bench that is set to an incline angle of no more than 30 degrees. Extend your arms above you with a slight bend at the elbows. Now rotate the wrists so that the palms of your hands are facing you. Tip: The pinky fingers should be next to each other. This will be your starting position. As you breathe in, start to slowly lower the arms to the side while keeping the arms extended and while rotating the wrists until the palms of the hand are facing each other. Tip: At the end of the movement the arms will be by your side with the palms facing the ceiling. As you exhale start to bring the dumbbells back up to the starting position by reversing the motion and rotating the hands so that the pinky fingers are next to each other again. Tip: Keep in mind that the movement will only happen at the shoulder joint and at the wrist. There is no motion that happens at the elbow joint. Repeat for the recommended amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/7SgC-yJn_c0"
      },
      {
         "Exercise":"incline push-up",
         "Descriptions":"Stand facing bench or sturdy elevated platform. Place hands on edge of bench or platform, slightly wider than shoulder width. Position forefoot back from bench or platform with arms and body straight. Arms should be perpendicular to body. Keeping body straight, lower chest to edge of box or platform by bending arms. Push body up until arms are extended. Repeat. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/bXsbK9UPu3c"
      },
      {
         "Exercise":"incline push-up depth jump",
         "Descriptions":"For this drill you will need a box about 12 inches high, and two thick mats or aerobics steps. Place the steps just outside of your shoulders, and place your feet on top of the box so that you are in an incline pushup position, your hands just inside the steps. This will be your starting position. Begin by bending at the elbows to lower your body, quickly reversing position to push your body off of the ground. As you leave the ground, move your hands onto the steps, bending your elbows to absorb the impact. Repeat the motion to return to the starting position. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/4_UvzuVjzsY"
      },
      {
         "Exercise":"incline push-up reverse grip",
         "Descriptions":"Stand facing a Smith machine bar or sturdy elevated platform at an appropriate height. Place your hands on the bar palms up, with your hands about shoulder width apart. Position your feet back from the bar with arms and body straight. This will be your starting position. Keeping your body straight, lower your chest to the bar by bending the arms. Return to the starting position by extending the elbows, pressing yourself back up. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/IJEwNcbDaew"
      },
      {
         "Exercise":"isometric wipers",
         "Descriptions":"Assume a push-up position, supporting your weight on your hands and toes while keeping your body straight. Your hands should be just outside of shoulder width. This will be your starting position. Begin by shifting your body weight as far to one side as possible, allowing the elbow on that side to flex as you lower your body. Reverse the motion by extending the flexed arm, pushing yourself up and then dropping to the other side. Repeat for the desired number of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/VxrSMH5vVWY"
      },
      {
         "Exercise":"leverage chest press",
         "Descriptions":"Load an appropriate weight onto the pins and adjust the seat for your height. The handles should be near the bottom or middle of the pectorals at the beginning of the motion. Your chest and head should be up and your shoulder blades retracted. This will be your starting position. Press the handles forward by extending through the elbow. After a brief pause at the top, return the weight just above the start position, keeping tension on the muscles by not returning the weight to the stops until the set is complete. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/6_8oghxIoaM"
      },
      {
         "Exercise":"leverage decline chest press",
         "Descriptions":"Load an appropriate weight onto the pins and adjust the seat for your height. The handles should be near the bottom of the pectorals at the beginning of the motion. Your chest and head should be up and your shoulder blades retracted. This will be your starting position. Press the handles forward by extending through the elbow. After a brief pause at the top, return the weight just above the start position, keeping tension on the muscles by not returning the weight to the stops until the set is complete. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/xK9zpXvjFUg"
      },
      {
         "Exercise":"leverage incline chest press",
         "Descriptions":"Load an appropriate weight onto the pins and adjust the seat for your height. The handles should be near the top of the pectorals at the beginning of the motion. Your chest and head should be up and your shoulder blades retracted. This will be your starting position. Press the handles forward by extending through the elbow. After a brief pause at the top, return the weight just above the start position, keeping tension on the muscles by not returning the weight to the stops until the set is complete. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/ig0NyNlSce4"
      },
      {
         "Exercise":"low cable crossover",
         "Descriptions":"To move into the starting position, place the pulleys at the low position, select the resistance to be used and grasp a handle in each hand. Step forward, gaining tension in the pulleys. Your palms should be facing forward, hands below the waist, and your arms straight. This will be your starting position. With a slight bend in your arms, draw your hands upward and toward the midline of your body. Your hands should come together in front of your chest, palms facing up. Return your arms back to the starting position after a brief pause. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/M1N804yWA-8s"
      },
      {
         "Exercise":"machine bench press",
         "Descriptions":"Sit down on the Chest Press Machine and select the weight. Step on the lever provided by the machine since it will help you to bring the handles forward so that you can grab the handles and fully extend the arms. Grab the handles with a palms-down grip and lift your elbows so that your upper arms are parallel to the floor to the sides of your torso. Tip: Your forearms will be pointing forward since you are grabbing the handles. Once you bring the handles forward and extend the arms you will be at the starting position. Now bring the handles back towards you as you breathe in. Push the handles away from you as you flex your pecs and you breathe out. Hold the contraction for a second before going back to the starting position. Repeat for the recommended amount of reps. When finished step on the lever again and slowly get the handles back to their original place. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/X2QQXX3qO9E"
      },
      {
         "Exercise":"neck press",
         "Descriptions":"Lie back on a flat bench. Using a medium-width grip (a grip that creates a 90-degree angle in the middle of the movement between the forearms and the upper arms), lift the bar from the rack and hold it straight over your neck with your arms locked. This will be your starting position. As you breathe in, come down slowly until you feel the bar on your neck. After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your chest muscles. Lock your arms and squeeze your chest in the contracted position, hold for a second and then start coming down slowly again. Tip: It should take at least twice as long to go down than to come up). Repeat the movement for the prescribed amount of repetitions. When you are done, place the bar back in the rack. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/HBh9sFfzPVM"
      },
      {
         "Exercise":"one-arm flat bench dumbbell flye",
         "Descriptions":"Lie down on a flat bench with a dumbbell in one hand resting on top of your thigh. The palm of your hand with the dumbbell in it should be at a neutral grip. By using your thighs to help you get the dumbbell up, clean the dumbbell so that you can hold it in front of you with your lifting arm being fully extended. Remember to maintain a neutral grip with this exercise. Your non lifting hand should be to the side holding the flat bench for better support. This will be your starting position. Your arm with the weight should have a slight bend on your elbow in order to prevent stress at the biceps tendon. Begin by lowering your arm with the weight in it out in a wide arc until you feel a stretch on your chest. Breathe in as you perform this portion of the movement. Tip: Keep in mind that throughout the movement, your lifting arm should remain stationary; the movement should only occur at the shoulder joint. Return your lifting arm back to the starting position as you squeeze your chest muscles and breathe out. Tip: Make sure to use the same arc of motion used to lower the weights. Hold for a second at the contracted position and repeat the movement for the prescribed amount of repetitions. Switch arms and repeat the exercise. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/7LnGW4ik3hU"
      },
      {
         "Exercise":"plyo kettlebell pushups",
         "Descriptions":"Place a kettlebell on the floor. Place yourself in a pushup position, on your toes with one hand on the ground and one hand holding the kettlebell, with your elbows extended. This will be your starting position. Begin by lowering yourself as low as you can, keeping your back straight. Quickly and forcefully reverse direction, pushing yourself up to the other side of the kettlebell, switching hands as you do so. Continue the movement by descending and repeating the movement back and forth. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/hw14FbggBy4"
      },
      {
         "Exercise":"push-up wide",
         "Descriptions":"With your hands wide apart, support your body on your toes and hands in a plank position. Your elbows should be extended and your body straight. Do not allow your hips to sag. This will be your starting position. To begin, allow the elbows to flex, lowering your chest to the floor as you inhale. Using your pectoral muscles, press your upper body back up to the starting position by extending the elbows. Exhale as you perform this step. After pausing at the contracted position, repeat the movement for the prescribed amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/rr6eFNNDQdU"
      },
      {
         "Exercise":"pushups",
         "Descriptions":"Lie on the floor face down and place your hands about 36 inches apart while holding your torso up at arms length. Next, lower yourself downward until your chest almost touches the floor as you inhale. Now breathe out and press your upper body back up to the starting position while squeezing your chest. After a brief pause at the top contracted position, you can begin to lower yourself downward again for as many repetitions as needed. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/IODxDxX7oi4"
      },
      {
         "Exercise":"single-arm cable crossover",
         "Descriptions":"Begin by moving the pulleys to the high position, select the resistance to be used, and take a handle in each hand. Step forward in front of both pulleys with your arms extended in front of you, bringing your hands together. Your head and chest should be up as you lean forward, while your feet should be staggered. This will be your starting position. Keeping your left arm in place, allow your right arm to extend out to the side, maintaining a slight bend at the elbow. The right arm should be perpendicular to the body at approximately shoulder level. Return your arm back to the starting position by pulling your hand back to the midline of the body. Hold for a second at the starting position and repeat the movement on the opposite side. Continue alternating back and forth for the prescribed number of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/ZWSrQF4UMa8"
      },
      {
         "Exercise":"single-arm push-up",
         "Descriptions":"Begin laying prone on the ground. Move yourself into a position supporting your weight on your toes and one arm. Your working arm should be placed directly under the shoulder, fully extended. Your legs should be extended, and for this movement you may need a wider base, placing your feet further apart than in a normal push-up. Maintain good posture, and place your free hand behind your back. This will be your starting position. Lower yourself by allowing the elbow to flex until you touch the ground. Descend slowly, and reverse direction be extending the arm to return to the starting position. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/JiHkxqbhNuw"
      },
      {
         "Exercise":"smith machine incline bench press",
         "Descriptions":"Place an incline bench underneath the smith machine. Place the barbell at a height that you can reach when lying down and your arms are almost fully extended. Once the weight you need is selected, lie down on the incline bench and make sure your upper chest is aligned with the barbell. Using a pronated grip (palms facing forward) that is wider than shoulder width, unlock the bar from the rack and hold it straight over you with your arms locked. This will be your starting position. As you breathe in, come down slowly until you feel the bar on your upper chest. After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your chest muscles. Lock your arms in the contracted position, hold for a second and then start coming down slowly again. Tip: It should take at least twice as long to go down than to come up. Repeat the movement for the prescribed amount of repetitions. When you are done, place the bar back in the rack. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/oe7N2GUzHIw"
      },
      {
         "Exercise":"straight-arm dumbbell pullover",
         "Descriptions":"Place a dumbbell standing up on a flat bench. Ensuring that the dumbbell stays securely placed at the top of the bench, lie perpendicular to the bench (torso across it as in forming a cross) with only your shoulders lying on the surface. Hips should be below the bench and legs bent with feet firmly on the floor. The head will be off the bench as well. Grasp the dumbbell with both hands and hold it straight over your chest at arms length. Both palms should be pressing against the underside one of the sides of the dumbbell. This will be your starting position. Caution: Always ensure that the dumbbell used for this exercise is secure. Using a dumbbell with loose plates can result in the dumbbell falling apart and falling on your face. While keeping your arms straight, lower the weight slowly in an arc behind your head while breathing in until you feel a stretch on the chest. At that point, bring the dumbbell back to the starting position using the arc through which the weight was lowered and exhale as you perform this movement. Hold the weight on the initial position for a second and repeat the motion for the prescribed number of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/I1iizuTNl2k"
      },
      {
         "Exercise":"suspended push-up",
         "Descriptions":"Anchor your suspension straps securely to the top of a rack or other object. Grab the handles with an overhand grip and set yourself up in a push-up position so that your body forms a straight line from your shoulders to your ankles. Your arms should be fully extended and your core tight to help maintain proper position. Maintaining a straight, ridged torso, descend slowly by allowing the elbows to flex. Continue until your elbows break 90 degrees, pausing before you extend to return to the starting position. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/xWsWrXL7D8s"
      },
      {
         "Exercise":"wide-grip decline barbell bench press",
         "Descriptions":"Lie back on a decline bench with the feet securely locked at the front of the bench. Using a wide, pronated (palms forward) grip that is around 3 inches away from shoulder width (for each hand), lift the bar from the rack and hold it straight over you with your arms locked. The bar will be perpendicular to the torso and the floor. This will be your starting position. As you breathe in, come down slowly until you feel the bar on your lower chest. After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your chest muscles. Lock your arms and squeeze your chest in the contracted position, hold for a second and then start coming down slowly again. Tip: It should take at least twice as long to go down than to come up. Repeat the movement for the prescribed amount of repetitions. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/UH3w618WAAc"
      }
   ]
	
}