{
  "legs": [
    {
         "Exercise":"ankle on the knee",
         "Descriptions":"From a lying position, bend your knees and keep your feet on the floor. Place your ankle of one foot on your opposite knee. Grasp the thigh or knee of the bottom leg and pull both of your legs into the chest. Relax your neck and shoulders. Hold for 10-20 seconds and then switch sides. ",
         "Secondary":"Glutes",
         "link":"https://www.youtube.com/embed/zpaExOK4S8M"
      },
      {
         "Exercise":"barbell hip thrust",
         "Descriptions":"Begin seated on the ground with a bench directly behind you. Have a loaded barbell over your legs. Using a fat bar or having a pad on the bar can greatly reduce the discomfort caused by this exercise. Roll the bar so that it is directly above your hips, and lean back against the bench so that your shoulder blades are near the top of it. Begin the movement by driving through your feet, extending your hips vertically through the bar. Your weight should be supported by your shoulder blades and your feet. Extend as far as possible, then reverse the motion to return to the starting position.",
         "Secondary":"Glutes",
         "link":"https://www.youtube.com/embed/A8nFGuY77CE"
      },
      {
         "Exercise":"downward facing balance",
         "Descriptions":"Lie facedown on top of an exercise ball. While resting on your stomach on the ball, walk your hands forward along the floor and lift your legs, extending your elbows and knees.",
         "Secondary":"Glutes",
         "link":"https://www.youtube.com/embed/xHGmB73BLAQ"
      },
      {
         "Exercise":"flutter kicks",
         "Descriptions":"On a flat bench lie facedown with the hips on the edge of the bench, the legs straight with toes high off the floor and with the arms on top of the bench holding on to the front edge. Squeeze your glutes and hamstrings and straighten the legs until they are level with the hips. This will be your starting position. Start the movement by lifting the left leg higher than the right leg. Then lower the left leg as you lift the right leg. Continue alternating in this manner (as though you are doing a flutter kick in water) until you have done the recommended amount of repetitions for each leg. Make sure that you keep a controlled movement at all times. Tip: You will breathe normally as you perform this movement.",
         "Secondary":"Glutes",
         "link":"https://www.youtube.com/embed/ANVdMDaYRts"
      },
      {
         "Exercise":"hip extension with bands",
         "Descriptions":"Secure one end of the band to the lower portion of a post and attach the other to one ankle. Facing the attachment point of the band, hold on to the column to stabilize yourself. Keeping your head and your chest up, move the resisted leg back as far as you can while keeping the knee straight. Return the leg to the starting position.",
         "Secondary":"Glutes",
         "link":"https://www.youtube.com/embed/dzhz67lXkAE"
      },
      {
         "Exercise":"hip lift with band",
         "Descriptions":"After choosing a suitable band, lay down in the middle of the rack, after securing the band on either side of you. If your rack doesn't have pegs, the band can be secured using heavy dumbbells or similar objects, just ensure they won't move. Adjust your position so that the band is directly over your hips. Bend your knees and place your feet flat on the floor. Your hands can be on the floor or holding the band in position. Keeping your shoulders on the ground, drive through your heels to raise your hips, pushing into the band as high as you can. Pause at the top of the motion, and return to the starting position.",
         "Secondary":"Glutes",
         "link":"www.youtube.com/embed/DrBljxQuo1E"
      },
      {
         "Exercise":"knee across the body",
         "Descriptions":"Lie down on the floor with your right leg straight. Bend your left leg and lower it across your body, holding the knee down toward the floor with your right hand. (The knee doesn't need to touch the floor if you're tight.) Place your left arm comfortably beside you and turn your head to the left. Imagine you have a weight tied to your tailbone. let your tailbone fall back toward the floor as your chest reaches in the opposite direction to stretch your lower back. Switch sides.",
         "Secondary":"Glutes",
         "link":"https://www.youtube.com/embed/bW_kZbQmums"
      },
      {
         "Exercise":"kneeling jump squat",
         "Descriptions":"Begin kneeling on the floor with a barbell racked across the back of your shoulders, or you can use your body weight for this exercise. This can be done inside of a power rack to make unracking easier.Sit back with your hips until your glutes touch your feet, keeping your head and chest up.Explode up with your hips, generating enough power to land with your feet flat on the floor.Continue with the squat by driving through your heels and extending the knees to come to a standing position.",
         "Secondary":"Glutes",
         "link":"https://www.youtube.com/embed/Ng3mdvyH9EQ"
      },
      {
         "Exercise":"kneeling squat",
         "Descriptions":"Set the bar to the proper height in a power rack. Kneel behind the bar; it may be beneficial to put a mat down to pad your knees. Slide under the bar, racking it across the back of your shoulders. Your shoulder blades should be retracted and the bar tight across your back. Unrack the weight.With your head looking forward, sit back with your butt until you touch your calves.Reverse the motion, returning the torso to an upright position.",
         "Secondary":"Glutes",
         "link":"https://www.youtube.com/embed/zYQ-WdosIwI"
      },
      {
         "Exercise":"single leg glute bridge",
         "Descriptions":"Lay on the floor with your feet flat and knees bent. Raise one leg off of the ground, pulling the knee to your chest. This will be your starting position. Execute the movement by driving through the heel, extending your hip upward and raising your glutes off of the ground. Extend as far as possible, pause and then return to the starting position.",
         "Secondary":"Glutes",
         "link":"https://www.youtube.com/embed/fDxl-0uZMJo"
      },
      {
         "Exercise":"band good morning (pull through)",
         "Descriptions":"Loop the band around a post. Standing a little ways away, loop the opposite end around the neck. Your hands can help hold the band in position. Begin by bending at the hips, getting your butt back as far as possible. Keep your back flat and bend forward to about 90 degrees. Your knees should be only slightly bent. Return to the starting position be driving through with the hips to come back to a standing position.",
         "Secondary":"Hamstring",
         "link":"https://www.youtube.com/embed/Eaqaj4Zf7mc"
      },
      {
         "Exercise":"box jump (multiple response)",
         "Descriptions":"Assume a relaxed stance facing the box or platform approximately an arm's length away. Arms should be down at the sides and legs slightly bent. Using the arms to aid in the initial burst, jump upward and forward, landing with feet simultaneously on top of the box or platform. Immediately drop or jump back down to the original starting place; then repeat the sequence.",
         "Secondary":"Hamstring",
         "link":"https://www.youtube.com/embed/hxldG9FX4j4"
      },
      {
         "Exercise":"chair leg extended stretch",
         "Descriptions":"Sit upright in a chair and grip the seat on the sides. Raise one leg, extending the knee, flexing the ankle as you do so. Slowly move that leg outward as far as you can, and then back to the center and down. Repeat for your other leg.",
         "Secondary":"Hamstring",
         "link":"https://www.youtube.com/embed/fs32F4H2CqI"
      },
      {
         "Exercise":"clean",
         "Descriptions":"With a barbell on the floor close to the shins, take an overhand (or hook) grip just outside the legs. Lower your hips with the weight focused on the heels, back straight, head facing forward, chest up, with your shoulders just in front of the bar. This will be your starting position. Begin the first pull by driving through the heels, extending your knees. Your back angle should stay the same, and your arms should remain straight. Move the weight with control as you continue to above the knees. Next comes the second pull, the main source of acceleration for the clean. As the bar approaches the mid-thigh position, begin extending through the hips. In a jumping motion, accelerate by extending the hips, knees, and ankles, using speed to move the bar upward. There should be no need to actively pull through the arms to accelerate the weight; at the end of the second pull, the body should be fully extended, leaning slightly back, with the arms still extended. As full extension is achieved, transition into the third pull by aggressively shrugging and flexing the arms with the elbows up and out. At peak extension, aggressively pull yourself down, rotating your elbows under the bar as you do so. Receive the bar in a front squat position, the depth of which is dependent upon the height of the bar at the end of the third pull. The bar should be racked onto the protracted shoulders, lightly touching the throat with the hands relaxed. Continue to descend to the bottom squat position, which will help in the recovery. Immediately recover by driving through the heels, keeping the torso upright and elbows up. Continue until you have risen to a standing position.",
         "Secondary":"Hamstring",
         "link":"https://www.youtube.com/embed/KjGvwQl8tis"
      },
      {
         "Exercise":"double kettlebell alternating hang clean",
         "Descriptions":"Place two kettlebells between your feet. To get in the starting position, push your butt back and look straight ahead. Clean one kettlebell to your shoulder and hold on to the other kettlebell. With a fluid motion, lower the top kettlebell while driving the bottom kettlebell up.",
         "Secondary":"Hamstring",
         "link":"https://www.youtube.com/embed/JX64eQ4Ffq4"
      },
      {
         "Exercise":"front leg raises",
         "Descriptions":"With a fluid motion, lower the top kettlebell while driving the bottom kettlebell up. Swing your leg forward, keeping the leg straight. Continue with a downward swing, bringing the leg as far back as your flexibility allows. Repeat 5-10 times, and then switch legs.",
         "Secondary":"Hamstring",
         "link":"https://www.youtube.com/embed/XudXPbq-Cvs"
      },
      {
         "Exercise":"glute ham raise",
         "Descriptions":"Begin by adjusting the equipment to fit your body. Place your feet against the footplate in between the rollers as you lie facedown. Your knees should be just behind the pad. Start from the bottom of the movement. Keep your back arched as you begin the movement by flexing the knees. Drive your toes into the foot plate as you do so. Keep your upper body straight, and continue until your body is upright. Return to the starting position, keeping your descent under control.",
         "Secondary":"Hamstring",
         "link":"https://www.youtube.com/embed/lZbONXtf07g"
      },
      {
         "Exercise":"good morning off pins",
         "Descriptions":"Begin with a bar on a rack at about the same height as your stomach. Bend over underneath the bar and rack the bar across the rear of your shoulders as you would a power squat, not on top of your shoulders. At the proper height, you should be near parallel to the floor when bent over. Keep your back tight, shoulder blades pinched together, and your knees slightly bent. Keep your back arched and your cervical spine in proper alignment. Begin the motion by extending through the hips with your glutes and hamstrings, and you are standing with the weight. Slowly lower the weight back to the pins returning to the starting position.",
         "Secondary":"Hamstring",
         "link":"https://www.youtube.com/embed/Kc3uOsO_DcE"
      },
      {
         "Exercise":"hamstring-smr",
         "Descriptions":"In a seated position, extend your legs over a foam roll so that it is position on the back of the upper legs. Place your hands to the side or behind you to help support your weight. This will be your starting position. Using your hands, lift your hips off of the floor and shift your weight on the foam roll to one leg. Relax the hamstrings of the leg you are stretching. Roll over the foam from below the hip to above the back of the knee, pausing at points of tension for 10-30 seconds. Repeat for the other leg.",
         "Secondary":"Hamstring",
         "link":"https://www.youtube.com/embed/wQ6uUuBWCbw"
      },
      {
         "Exercise":"hang snatch",
         "Descriptions":"Begin with a wide grip on the bar, with an overhand or hook grip. The feet should be directly below the hips with the feet turned out. Your knees should be slightly bent, and the torso inclined forward. The spine should be fully extended and the head facing forward. The bar should be at the hips. This will be your starting position. Aggressively extend through the legs and hips. At peak extension, shrug the shoulders and allow the elbows to flex to the side. As you move your feet into the receiving position, forcefully pull yourself below the bar as you elevate the bar overhead. Receive the bar with your body as low as possible and the arms fully extended overhead. Return to a standing position with the weight overhead. Follow by returning the weight to the ground under control.",
         "Secondary":"Hamstring",
         "link":"https://www.youtube.com/embed/zxdfWgksUZY"
      },
      {
         "Exercise":"hanging bar good morning",
         "Descriptions":"Begin with a bar on a rack at about the same height as your stomach. Suspend the bar using chains or suspension straps. Bend over underneath the bar and rack the bar across the rear of your shoulders as you would a power squat, not on top of your traps. At the proper height, you should be near parallel to the floor when bent over. Keep your back tight, shoulder blades pinched together, and your knees slightly bent. Keep your back arched and your cervical spine in proper alignment. Begin the motion by extending through the hips with your glutes and hamstrings, and you are standing with the weight. Slowly lower the weight back to the starting position, where it is supported by the chains.",
         "Secondary":"Hamstring",
         "link":"https://www.youtube.com/embed/rPkejsfe1TA"
      },
      {
         "Exercise":"intermediate groin stretch",
         "Descriptions":"Lie on the ground with a rope wrapped around one of your feet. Extend your leg as far as you can to one side. Pull gently on the rope to create tension on your groin.",
         "Secondary":"Hamstring",
         "link":"https://www.youtube.com/embed/9bsdiDyQuHc"
      },
      {
         "Exercise":"kettlebell one-legged deadlift",
         "Descriptions":"Stand on one leg with a kettlebell in front of that leg. With your knees slightly bent perform a stiff leg deadlift.",
         "Secondary":"Hamstring",
         "link":"https://www.youtube.com/embed/054ea9tBEIA"
      },
      {
         "Exercise":"knee tuck jump",
         "Descriptions":"Squat down with your hands in front of you with fingers touching each other. Jump up as high as you can, and lift your knees to touch your hands.",
         "Secondary":"Hamstring",
         "link":"https://www.youtube.com/embed/BDA3DERQKFk"
      },
      {
         "Exercise":"linear 3-part start technique",
         "Descriptions":"Squat down and lean forward. Make sure your head is lower than your hips. With your weight loaded onto your left leg. Sprint ss hard as you can.",
         "Secondary":"Hamstring",
          "link":"https://www.youtube.com/embed/YPIUKb7N3js"
      },
      {
         "Exercise":"lying hamstring",
         "Descriptions":"Lie on your back with one of your legs raised to the ceiling. Have someone push your raised leg towards your chest until you feel a stretch. Hold that position for at least 10 seconds. Repeat with other leg.",
         "Secondary":"Hamstring",
         "link":"https://www.youtube.com/embed/My9vwqkk4lA"
      },
      {
         "Exercise":"lying leg curls",
         "Descriptions":"Put your chest on the bench, and your legs under the padded cylinder. Raise your legs as far up as you can.",
         "Secondary":"Hamstring",
         "link":"https://www.youtube.com/embed/dBo-Pw2a2h8"
      },
      {
         "Exercise":"muscle snatch",
         "Descriptions":"With a wide grip hold a barbell on your mid thigh. Lower your hips and begin to drive up with the front of your heels. Next drive the bar straight up into an overhead position.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/IFG3FHf98bQ"
      },
      {
         "Exercise":"one-arm kettlebell swings",
         "Descriptions":"Have a kettlebell between your feet. Have a flat back and look straight ahead. Swing the kettlebell between your legs. Reverse the direction and repeat.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/R8uI-EopErw"
      },
      {
         "Exercise":"open palm kettlebell clean",
         "Descriptions":"1) Have a kettlebell between your feet. Perform a clean. Release the kettlebell as it is swinging up. Catch the Kettlebell with your palm, and slowly bring the kettle bell down holding the handle.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/6AIlgwod8cY"
      },
      {
         "Exercise":"platform hamstring slides",
         "Descriptions":"Lay flat on the floor on your back. With a towel under your foot. Slide your foot back and forth.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/GgKvpNgq-B4"
      },
      {
         "Exercise":"power clean from blocks",
         "Descriptions":"Have two elevated platforms , next place your loade barbell ontop of the platforms. Perform a power clean, after finishing, lower the barbell on the platform.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/ztNOYTwnqjE"
      },
      {
         "Exercise":"prowler sprint",
         "Descriptions":"Load up a sled with desired weight. With your hands on the handle drive your legs through pushing the sled.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/77yL9mmWQqA"
      },
      {
         "Exercise":"reverse band sumo deadlift",
         "Descriptions":"With bands wrapped around the barbell and the top part of a power rack. Perform a sumo deadlift within the power rack.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/W0nVMbJ3xfg"
      },
      {
         "Exercise":"romanian deadlift",
         "Descriptions":"Hold a bar at hip level, with palms facing down and shower blades back, knees slightly bent, and back arched. With your butt back perform a deadlift.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/JCXUYuzwNrM"
      },
      {
         "Exercise":"runner's stretch",
         "Descriptions":"Put one leg behind you. Lower your torso and plce your hands on your front leg to feel the stretch. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/6f9wNXc19UE"
      },
      {
         "Exercise":"seated hamstring and calf stretch",
         "Descriptions":"With a band wrapped around your foot, lean forward and grasp the band to feel the calf stretch.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/C0TlAEKbkIY"
      },
      {
         "Exercise":"seated leg curl",
         "Descriptions":"Sit on the machine, with your legs under the padding of the shins. Raise your legs with the desired weight.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/ELOCsoDSmrg"
      },
      {
         "Exercise":"smith machine hang power clean",
         "Descriptions":"Perform a power clean using the smith machine. With knees bent Drive the bar up.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/YjxK7RppzIM"
      },
      {
         "Exercise":"smith machine stiff-legged deadlift",
         "Descriptions":"With straight legs perform a deadlift within the smith machine.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/L7rf2oJJM7Q"
      },
      {
         "Exercise":"split snatch",
         "Descriptions":"Perform a snatch, on the top push your desired leg back.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/aDJQFTO0dPY"
      },
      {
         "Exercise":"split squats",
         "Descriptions":"Have your desired leg elevated on a bench, with your other foot forward. With chest up perform a squat and return to starting position.",
         "Secondary":"Quadraceps",
         "link":"https://www.youtube.com/embed/lvvttdzUKcc"
      },
      {
         "Exercise":"standing leg curl",
         "Descriptions":"Have one knee placed on the platform. With the other leg bring your leg up. Maintain proper form and repeat with the other leg.",
         "Secondary":"Hamstring",
         "link":"https://www.youtube.com/embed/Z053-kKjesQ"
      },
      {
         "Exercise":"standing toe touches",
         "Descriptions":"Stand with space in front of you. Bend at the waist with straight legs and touch your toes. Hold the position and feel the stretch.",
         "Secondary":"Hamstrings",
         "link":"https://www.youtube.com/embed/Xvr5N_Xf6QM"
      },
      {
         "Exercise":"stiff-legged dumbbell deadlift",
         "Descriptions":"Hold dumbells on your side. With straight legs Bend at your waist. Feel the stretch on your hamstrings and descend with a straight and non rounded back. Return to the original position maintaining straight legs",
         "Secondary":"Hamstrings",
         "link":"https://www.youtube.com/embed/fai6L-DQ8a0"
      },
      {
         "Exercise":"sumo deadlift with bands",
         "Descriptions":"Run two bands through the bar. With your foot step on the other end of the bands. Perform a sumo deadlift while making sure your foot is on the bands.",
         "Secondary":"Hamstrings",
         "link":"https://www.youtube.com/embed/r5oWXl6e9fQ"
      },
      {
         "Exercise":"the straddle",
         "Descriptions":"Sit on the floor and bring your legs in a V position. Place your hands on the ground and move them forward as much as possible while maintaining form.",
         "Secondary":"Hamstrings",
         "link":"https://www.youtube.com/embed/nboaRQckk5A"
      },
      {
         "Exercise":"vertical swing",
         "Descriptions":"Hold a dumbell in one of your hands. Bend at the knees and push your butt back. Place the dumbell between your legs. Drive through your legs and swing the dumbell forward.",
         "Secondary":"Hamstring",
         "link":"https://www.youtube.com/embed/n-AefaW2K2w"
      },
      {
         "Exercise":"wide stance stiff legs",
         "Descriptions":"With legs spread slightly more than than the stand sumo deadlift. With legs straight perform a stiff leg deadlift.",
         "Secondary":"Hamstrings",
         "link":"https://www.youtube.com/embed/Gcwa0Dw08vE"
      },
      {
         "Exercise":"backward drag",
         "Descriptions":"Load a sled with weight. Begin by moving backwards and leaning back.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/k7JsvdG9sSo"
      },
      {
         "Exercise":"barbell full squat",
         "Descriptions":"Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time. Step away from the rack and position your legs using a shoulder-width medium stance with the toes slightly pointed out. Lower the bar by bending the knees and sitting back with your hips as you maintain a straight posture. Continue down until your hamstrings are on your calves. Begin to raise the bar as you exhale by pushing the floor with the heel or middle of your foot as you straighten the legs and extend the hips to go back to the starting position.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"barbell squat",
         "Descriptions":"Begin with the barbell supported on top of the traps. Take a hip-width stance with the feet turned out. Descend by flexing the knees and ensure that they stay align with the feet. The goal is to keep the torso as upright as possible. Continue all the way down, keeping the weight on the front of the heel. At the moment the upper legs contact the lower legs reverse the motion, driving the weight upward.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"barbell step ups",
         "Descriptions":"Stand up straight while holding a barbell placed on the back of your shoulders and stand upright behind an elevated platform. Step on the platform by extending the hip and the knee of your right leg. Use the heel mainly to lift the rest of your body up and place the foot of the left leg on the platform as well. Breathe out as you execute the force required to come up. Step down with the left leg by flexing the hip and knee of the right leg as you inhale.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"bench jump",
         "Descriptions":"Begin with a box or bench 1-2 feet in front of you. Stand with your feet shoulder width apart. Perform a short squat and swing your arms behind you. Rebound out of this position, extending through the hips, knees, and ankles to jump as high as possible, over the bench, landing with the knees bent. Turn around and face the opposite direction, then jump back over the bench.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"bench sprint",
         "Descriptions":"Stand on the ground with one foot resting on a bench or box with your heel close to the edge. Push off with your foot on top of the bench, extending through the hip and knee. Land with the opposite foot on top of the box, returning your other foot back to the start position.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"bicycling",
         "Descriptions":"Sit on a bike and pedal. Has excellent caqrdiovascular benefits and great demand on the leg muscles.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"bodyweight walking lunge",
         "Descriptions":"Step forward with one leg, flexing the knees to drop your hips. Descend until your rear knee nearly touches the ground. Your posture should remain upright, and your front knee should stay above the front foot. Drive through the heel of your lead foot and extend both knees to raise yourself back up.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"box squat",
         "Descriptions":"Begin by stepping under the bar and placing it across the back of the shoulders. Remove the bar from the rack and step back into position. Place your feet wider for more emphasis on the back, glutes, adductors, and hamstrings, or closer together for more quad development. With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips until you are seated on the box. Pause when you reach the box, and relax the hip flexors",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"box squat with chains",
         "Descriptions":"A heavy chain should be attached using a snap hook on the bar.  Begin by stepping under the bar and placing it across the back of the shoulders. Remove the bar from the rack and keep your head facing forward. With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips until you are seated on the box.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"chair squat",
         "Descriptions":"Take the bar with your hands facing forward, unlock it and lift it off the rack by extending your legs. Position your legs using a shoulder width stance with the toes slightly pointed out. Slowly lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until the angle between the upper and lower leg breaks 90 degrees.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"clean from blocks",
         "Descriptions":"With a barbell on boxes  lower your hips with the weight focused on the heels, back straight, head facing forward, chest up, with your shoulders just in front of the bar. Begin the first pull by driving through the heels, extending your knees. As the bar approaches the mid-thigh position, begin extending through the hips..",
         "Secondary":"Forearms"
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"dumbbell lunges",
         "Descriptions":"Stand with your torso upright holding two dumbbells in your hands by your sides. Step forward with your right leg and then using the heel of your foot, push up and go back to the starting position.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"dumbbell rear lunge",
         "Descriptions":"Stand with your torso upright holding two dumbbells in your hands by your sides. Step backward with your right leg and then push up. ",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"dumbbell seated box jump",
         "Descriptions":"Hold a dumbbell to your chest with both hands and seat yourself on a bench facing a box. Plant your feet firmly on the ground as you lean forward, extending through the hips and knees to jump up and forward. Land on the box with both feet.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"dumbbell squat to a bench",
         "Descriptions":"Stand up straight with a flat bench behind you while holding a dumbbell on each hand. Go down until you slightly touch the bench behind you. Begin to raise the bar as you exhale by pushing the floor with the heel of your foot as you straighten the legs again and go back to the starting position.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"elevated back lunge",
         "Descriptions":"Position a bar onto a rack at shoulder height. Place a short, raised platform behind you. Step onto your raised platform with both feet. Descend by flexing your hips and knees until your knee touches the floor. Pause, and extend through the hips and knees to rise up.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"elliptical trainer",
         "Descriptions":"Running on an eliptical machine for cardiovascular benefits as well as stengthening your leg muscles.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"freehand jump squat",
         "Descriptions":"Cross your arms over your chest. Keeping your back straight and chest up, squat down as you inhale until your upper thighs are parallel, or lower, to the floor. Jump straight up in the air as high as possible, using the thighs like springs.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"front barbell squat to a bench",
         "Descriptions":"Lift the bar off the rack by first pushing with your legs and at the same time straightening your torso. Begin to slowly lower the bar by bending the knees. Continue down until you touch the bench with your glutes.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"front squats with two kettlebells",
         "Descriptions":"Clean two kettlebells to your shoulders. Squat down as low as you can and pause at the bottom. As you squat down, push your knees out. You should squat between your legs, keeping an upright torso, with your head and chest up.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"goblet squat",
         "Descriptions":"Stand holding a light kettlebell by the horns close to your chest. Squat down between your legs until your hamstrings are on your calves. At the bottom position, pause and use your elbows to push your knees out.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"hack squat",
         "Descriptions":"Sit back on the hack squat machine and place your legs on the platform. Push your legs to straighten them and then lower your body until your legs are at 90 degrees.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"hang clean",
         "Descriptions":"Begin with a shoulder width, double overhand or hook grip, with the bar hanging at the mid thigh position. Begin by aggressively extending through the hips, knees and ankles, driving the weight upward. As you do so, shrug your shoulders towards your ears. After you are in a standing position, you can drop the weight.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"iron crosses (stretch)",
         "Descriptions":"Lie face down on the floor, with your arms extended out to your side, palms pressed to the floor. Flex one knee and bring that leg across the back of your body, attempting to touch it to the ground near the opposite hand.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"jefferson squats",
         "Descriptions":"Grab a barbell encrossed in the middle on your legs and stand up. Bend at the knees in a modified squat position. Now stand up and repeat this movement.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"jerk dip squat",
         "Descriptions":"Begin with the bar racked in the jerk position, with the shoulders forward to create a shelf and the bar lightly contacting the throat. Keeping the torso vertical, dip by flexing the knees, allowing them to travel forward and without moving the hips to the rear. Return the weight to the starting position by driving forcefully though the feet.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"jogging-treadmill",
         "Descriptions":"Run on a treadmill at desired speed. Can alternate between a light jog for 10 mins or a high intensity sprint for 5 minutes.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"leg extensions",
         "Descriptions":"Sit on the leg extension machine, with the pads resting on your ankles. Pull up your legs and hold the position for a second and go back down.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"leg press",
         "Descriptions":"Sit on the leg press machine and with both legs on either side of the platform, bring the wieght down and then push off using your quads.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"linear depth jump",
         "Descriptions":"You will need two boxes or benches spaced a few feet away from each other. Begin by standing on one box facing towards the other platform. Gently drop down to the ground between your platforms, allowing the knees and hips to flex. Reverse the motion by exploding, extending through the hips, knees, and ankles to jump onto the other platform.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"lunge sprint",
         "Descriptions":" Position yourself under the bar, racking it across the back of your shoulders. Unrack the bar, and then split your feet, moving one foot forward and one foot back. Lower your back knee nearly to the ground, flexing the knees and lowering your hips as you do so. At the bottom of the descent, immediately reverse direction.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"mountain climbers",
         "Descriptions":"Begin in a pushup position, with your weight supported by your hands and toes. Flexing the knee and hip, bring one leg until the knee is approximately under the hip. Explosively reverse the positions of your legs, extending the bent leg until the leg is straight and supported by the toe, and bringing the other foot up with the hip and knee flexed.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"narrow stance hack squats",
         "Descriptions":"1) lay on the bench 2) press the desired weight",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"narrow stance squats",
         "Descriptions":"Put the bar on your back shoulders and have your legs close to each other. Now try to go down using your hips to guide you in the narrow leg position.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"olympic squat",
         "Descriptions":"Begin with a barbell supported on top of the traps. Adopt a hip width stance with the feet turned out as needed. Descend by flexing the knees, refraining from moving the hips back as much as possible. At the moment the upper legs contact the lower, reverse the motion, driving the weight upward.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"on-your-back quad stretch",
         "Descriptions":"Lie on a flat bench and hang one leg and arm over the side. Bend the knee and hold the top of the foot. Press your foot down and into your hand. To add the hip stretch, lift the hip of the leg you're holding up toward the ceiling.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"one leg barbell squat",
         "Descriptions":"Having the barbell rest on your shoulders, have one leg up resting on a flat bench. Squat down on one leg, while your other leg rests on the bench. Stand up and then alternate legs.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"one-arm overhead kettlebell squats",
         "Descriptions":"Clean and press a kettlebell with one arm. Press the weight overhead by extending through the elbow. Looking straight ahead and keeping a kettlebell locked out above you, flex the knees and hips and lower your torso between your legs, keeping your head and chest up.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"power snatch from blocks",
         "Descriptions":"Perform a snatch and clean motion by lifting a barbell up that is resting on two blocks up to your shoulders and push your arms so it goes above your head.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"quadriceps-smr",
         "Descriptions":"Lay facedown on the floor with your weight supported by your hands or forearms. Place a foam roll underneath one leg on the quadriceps, and keep the foot off of the ground. Roll over the foam from above the knee to below the hip.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"recumbent bike",
         "Descriptions":"Perform a cycling motion on the recumber bicycle machine. Useful for cardiovascular and leg workouts.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"rope jumping",
         "Descriptions":"Stand up striaght with a jump rope behind you and toss it over you as you perform a continuous jump rope motion.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"scissors jump",
         "Descriptions":"Assume a lunge stance position with one foot forward with the knee bent, and the rear knee nearly touching the ground. Extending through both legs, jump as high as possible. As you land, absorb the impact through the legs by adopting the lunge position, and repeat.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"side hop-sprint",
         "Descriptions":"Begin this drill by hopping sideways over an obstacle, rebounding out of your landing to hop back to where you started. Hop for a number or repetitions and finish this drill by sprinting a short distance upon landing the last hop.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"side to side box shuffle",
         "Descriptions":"Stand to one side of the box with your left foot resting on the middle of it. Jump up and over to the other side of the box. Continue shuffling back and forth across the box.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"single-leg high box squat",
         "Descriptions":"Position a box in a rack. Secure a band or rope in place above the box. Standing in front of it, step onto the box to a full standing position, letting your other leg remain unsupported. Hold onto the band for balance. Continue stepping up and down on the same leg before switching to the opposite side.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"single-leg lateral hop",
         "Descriptions":"Stand to the side of a cone or hurdle. Stand on one leg with your knee slightly bent. Execute a counterjump to hop sideways over the cone. Land on your jumping leg, and immediately rebound out of it by jumping back to the start position. Continue hopping back and forth.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"single-leg stride jump",
         "Descriptions":"Stand to the side of a box with your inside foot on top of it, close to the edge. Begin by swinging the arms upward as you push through the top leg, jumping upward as high as possible. Land in the same position that you started, using your inside leg to decelerate the impact.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"sled drag - harness",
         "Descriptions":"To begin, load the sled with the desired weight and attach the pulling strap. with the harness attached to your body, move your body while dragging the sled in any direction.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"smith machine pistol squat",
         "Descriptions":"Step under the bar and place it on the back of your shoulders. Take the bar with your hands facing forward, unlock it and lift it off the rack by extending your legs. Move one foot forward about 12 inches in front of the bar. Extend the other leg out in front of you, holding it off the ground. Maintaining good posture, lower yourself by flexing the knee and hip, going down as far as flexibility allows.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"smith single-leg split squat",
         "Descriptions":"Squat on the smith machine with one leg resting on a flat bench.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"snatch balance",
         "Descriptions":"Begin with the bar racked across the back of the shoulders, and the hands placed in a wide snatch grip. Pop the bar with an abrupt dip and drive of the knees, and aggressively drive under the bar, transitioning the feet into the receiving position. Continue to descend to full depth, and return to a standing position.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"snatch from blocks",
         "Descriptions":"Perform a snatch and clean motion by lifting a barbell up that is resting on two blocks up to your shoulders and push your arms so it goes above your head.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"speed squats",
         "Descriptions":"Perform a standard back squat but go up and down really fast in order to perform many reps in a large amount of time.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"split jerk",
         "Descriptions":"Clean a bar over your shoulders, pull up and lunge forward with one knee. Bring the bar back to rest.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"squat with bands",
         "Descriptions":" Your feet should be shoulder width apart from each other. When holding the bands, they should be the same height on each side. Slowly start to bend the knees and lower the legs so that your thighs are parallel to the floor while exhaling. Use the heel of your feet to push your body up to the starting position as you exhale.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"squat with plate movers",
         "Descriptions":"Position a weight plate on the ground a couple feet back from the rack. Once the bar is loaded, step under it and place the back of your shoulders across it. Step away from the rack and adopt a wide stance with the toes slightly pointed out, with one foot on the weight plate. Begin to slowly lower the bar by bending the knees and hips. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees. Raise the bar as you exhale by pushing the floor with the heels of your feet as you extend the hips and knees. At the top of the movement, side step, bringing your feet together on the opposite side of the plate. Using your inside foot, push the weight plate, sliding it across the floor to where you were just standing. Place your inside foot on the weight plate, adopting a wide stance for the next repetition.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"stairmaster",
         "Descriptions":"Perform a climbing up the stair running motion on the stairmaster machine.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"standing elevated quad stretch",
         "Descriptions":"Start by standing with your back about two to three feet away from a bench or step. Lift one leg behind you and rest your foot on the step,either on your instep or the ball of your foot, whichever you find most comfortable. Keep your supporting knee slightly bent and avoid letting that knee extend out beyond your toes. Switch sides.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"step mill",
         "Descriptions":"Stair climbing machine that requires you to go up moving steps.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"stride jump crossover",
         "Descriptions":"Begin by swinging the arms upward as you push through the top leg, jumping upward as high as possible. Attempt to drive the opposite knee upward. Land in the opposite position that you started, on the opposite side of the box. The foot that was initially on the box will now be on the ground, with the opposite foot now on the box.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"trail running/walking",
         "Descriptions":"Running movement on a park trail provides good leg and cardiovascular workouts.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"weighted jump squat",
         "Descriptions":"Position a barbell across the back of your shoulders. Using a countermovement, squat partially down and immediately reverse your direction to explode off of the ground, extending through your hips, knees, and ankles.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"weighted sissy squat",
         "Descriptions":"Standing upright, with feet at shoulder width and toes raised, use one hand to hold onto the beams of a squat rack and the opposite arm to hold a plate on top of your chest. As you use one arm to hold yourself, bend at the knees and slowly lower your torso toward the ground by bringing your pelvis and knees forward. Use your thigh muscles to bring your torso back up to the starting position. Exhale as you move up.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"weighted squat",
         "Descriptions":"Performa squat motion on a elevated surface while having a weight wrapped around your body.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"yoke walk",
         "Descriptions":"Begin by racking a yoke across the back of the shoulders. With your head looking forward and back arched, lift the yoke by driving through the heels. Begin walking as quickly as possible using short, quick steps.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"balance board",
         "Descriptions":"Place a balance board in front of you. Stand up on it and try to balance yourself. Hold the balance for as long as desired.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"barbell seated calf raise",
         "Descriptions":"Place a block about 12 inches in front of a flat bench. Sit on the bench and place the ball of your feet on the block. Have someone place a barbell over your upper thighs about 3 inches above your knees and hold it there. Raise up on your toes as high as possible as you squeeze the calves and as you breathe out.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"calf press on the leg press machine",
         "Descriptions":"push on the leg press machine with your tip toes instead of your whole bottom of your legs.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"calf raises - with bands",
         "Descriptions":"While holding the handles of the band, raise the arms to the side of your head. Keeping the hands by your shoulder, stand up on your toes as you exhale and contract the calves hard at the top of the movement.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"calf stretch hands against wall",
         "Descriptions":"Stand facing a wall from several feet away. Stagger your stance, placing one foot forward. Lean forward and rest your hands on the wall, keeping your heel, hip and head in a straight line. Attempt to keep your heel on the ground.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"calves-smr",
         "Descriptions":"Begin seated on the floor. Place a foam roller underneath your lower leg. Place your hands to your side or just behind you, and press down to raise your hips off of the floor, placing much of your weight against your calf muscle.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"peroneals-smr",
         "Descriptions":"Lay on your side, supporting your weight on your forearm and on a foam roller placed on the outside of your lower leg. Raise your hips off of the ground and begin to roll from below the knee to above the ankle on the side of your leg.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"posterior tibialis stretch",
         "Descriptions":"In a seated position, loop a belt, rope, or band around one foot. With the leg extended and the heel off of the ground, pull on the belt so that the foot is everted, with the outside of the foot being pulled towards you.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"rocking standing calf raise",
         "Descriptions":"Hold on to the bar using both arms at each side and lift it off the rack. Raise your heels as you breathe out by extending your ankles as high as possible and flexing your calf. Go back slowly to the starting position as you breathe in by lowering your heels as you bend the ankles until calves are stretched.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"seated calf raise",
         "Descriptions":"Sit on the machine with your thighs below the pad and then move your legs up using tip toes.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"standing barbell calf raise",
         "Descriptions":"Have a barbell resting on yoru shoulders and stand on a pad. Go up with your tiptoes and then repeat this motion.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"standing calf raises",
         "Descriptions":"On a calf machine, with the pads resting on your shoulders, pull up using tip toes and then go back down.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"standing dumbbell calf raise",
         "Descriptions":"Move up and down using your tiptoes while holding dumbells on both hands.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      },
      {
         "Exercise":"standing gastrocnemius calf stretch",
         "Descriptions":"Place your right heel on a step with your knee extended and lean forward to grab your right toe with your right hand. Your left knee should be slightly bent and your back should be straight. Support your weight on your left leg and place your left hand on your left thigh. Pull your right toes toward your knee until you feel a stretch in your calf.",
         "Secondary":"Forearms",
         "link":"https://www.youtube.com/embed/"
      }
    ]
	
}